[
    {
        "source": "The winds are strong enough from keeping it from falling back to earth. This pattern of rising and falling continues.",
        "choices": [
            "You insert a coin into a vending machine. You turn the knob to receive the item.",
            "A person has enough motivation and perseverance to keep going. This pattern of perseverance and progress continues.",
            "A person is buried beneath piles of work. More and more tasks are added, burying the person even further.",
            "This pattern of rising and falling continues. The hail becomes too large to be pushed up by the wind."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "The sailboat is built to navigate the water with the sail open. It is propelled by the wind and cuts through the waves.",
        "choices": [
            "The mast is attached and secured. The sail is ready to be hoisted and set.",
            "Playing sport can lead to injury. Players must practice caution to avoid risk.",
            "The beautiful sailboat glided through the water, propelled only by the wind. The sun shimmered off the sails as the boat moved steadily across the waves.",
            "The tank is engineered to be used in war. It traverses the battlefield with its large treads."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The brain integrates signals from nerves. Consciousness arises from these signals.",
        "choices": [
            "The farmer loaded his truck with grain from the silo. It was the last bit of their harvest and he was satisfied.",
            "The troops marched to the battleground, ready to take down their enemies. Winning the war was their only chance of survival.",
            "Hardware requires an operating system. The CPU powers the device.",
            "The mind is composed of the brain and its neurons. Together, they store memories and regulate cognitive functions."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The judge made a sentence for the crime. The convicted person was to face the consequences.",
        "choices": [
            "The thing was broken, but it was able to be repaired. The damage was gradually restored.",
            "The doctor made a diagnosis of the beast. The treatment plan was set in motion.",
            "Ornaments are used to adorn the room. The decorations make the living space beautiful.",
            "A judge in 1931 handed down a punitive sentence, reflecting the times and their legal implications. The sentence served as a reminder of justice and consequences."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "The material is melted together. New products are created from the recyclable materials.",
        "choices": [
            "The books are arranged on the shelf. The library is filled with knowledge.",
            "Plates collide. A plate folds.",
            "Ideas and thoughts are blended together. New solutions are created from the combined elements.",
            "The materials are shredded. The shredded materials are compounded."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "He finally finished the epilogue of his book, a satisfactory ending to years of hard work and dedication.",
        "choices": [
            "A person's income can be affected by many factors. A unexpected loss of income can cause financial hardship.",
            "The witch mixed a potion from the butterfly's wings. Instantly, the room shimmered with light and energy.",
            "As the crowd rose to their feet, the orchestra finished the finale of the symphony, a beautiful climax to the night's performance.",
            "She took the time to meditate on her goal, believing that doing so would enable her to achieve it. Her hard work paid off in the end."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Adjusting and evolving through changing conditions leads to natural adaptation.",
        "choices": [
            "Negotiations between nations reach a dead-end. The political situation intensifies into a crisis.",
            "He enjoyed playing soccer and swimming in his spare moments. He made sure to make the most of each day.",
            "Natural selection is a process of adaptation that favors certain traits. It shapes organisms to be suited to their current environments, making them more likely to survive.",
            "Meeting certain standards of uniformity results in artificial conformance."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The outbreak is a precursor to devastation. It leads to widespread destruction.",
        "choices": [
            "He was appalled to see what had happened. He was dismayed by the destruction.",
            "He wasn't sure if he wanted to work or play. But he eventually concluded that he needed to focus on his assignments.",
            "The yacht is a luxurious boat. It's elegance sets it apart from any other vessel.",
            "The sudden spending spree causes an economic depletion. It leads to escalating levels of poverty."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "People celebrate after a successful event. Individuals are proud of their accomplishments.",
        "choices": [
            "A vehicle takes you away. The vehicle helps you transport.",
            "The audience applauds after each act. The actors feel rewarded for their work.",
            "Individuals from all walks of life gather at the event. Through shared experiences, mutual understanding is exchanged between the people.",
            "The worker suffered a serious injury. Immediate attention was necessary to avoid further complications."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "He was so excited to purchase his first computer and can't wait to set it up in his house. He had big plans to explore its endless capabilities.",
        "choices": [
            "A computer is essential for success in school. The computer helps organize information.",
            "She couldn't help but window shop even though she didn't have enough money. Annika looked at the prices in lustful admiration.",
            "The bride was glowing as she walked down the aisle, ready to wed the man she loved. She eagerly awaited their life together.",
            "The tip of a needle is sharp. The needle grows narrower at the point."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Scoop the coffee into the filter. Set the machine to make a half or full pot.",
        "choices": [
            "A person's emotions become intense and fiery. Their emotions burst out and become more controlled and solidified as they are expressed outwardly.",
            "Put into a backpack. Supplies are added to the pockets.",
            "Gather the ingredients for a cake recipe. Adjust the oven temperature for a small or large cake.",
            "Add water to the coffee machine. Use a coffee filter in the machine."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The forest is a cluster of trees. Each tree is unique, with its own shape and size.",
        "choices": [
            "Playing a sport is fun. Participants have the opportunity to move, engage, and interact with others.",
            "The sailor prepared to sail the seas. She was ready to discover new lands on the planet Earth.",
            "The leaves on the tree have fallen. The tree's structure is altered.",
            "The earth is a complex of atmosphere, lithosphere, hydrosphere, and biosphere. All of these components interact to form a unique environment."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Pick out your favorite clothes. Organize your toiletries.",
        "choices": [
            "Salt dissolves in water. Bacteria reacts with organic matter.",
            "Choose the food you want to eat. Arrange the dishes on the table.",
            "Make sure you have plenty of toiletries. Get all the sunblock needed.",
            "The earth can shake. Depending on the size and location of the plates."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "I tossed the frisbee into the air and ran to catch it. It felt like childhood all over again.",
        "choices": [
            "The cat pounces on the tiny mouse. Its sharp teeth sink into the prey's fur.",
            "The towel bar was securely fastened to the wall. The user then hung the towel on the bar without worry of it falling off.",
            "You play frisbee by catching the frisbee as it moves through the air. This enables you to enjoy playing frisbee with your friends.",
            "I kneeled down beside my bed and began to pray. It was a ritual I kept up each night before bed."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "After careful consideration, the team retracted their initial claim, ultimately winning the argument.",
        "choices": [
            "It's difficult to defend a claim when others try to criticize it. The arguments become divided and hard to connect.",
            "The sword is a deadly weapon. It can even the odds when used skilfully.",
            "The troops retreated with honor after a long-fought victory.",
            "The person was determined and motivated, but their bank account was too small to get what they wanted. Nothing seemed to help."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The person opened up their wardrobe, eagerly searching for the perfect outfit. After trying on several, the perfect one finally emerged.",
        "choices": [
            "Reproduce by having sex. The actions result in the joining of two people for conception.",
            "The person eagerly put together an outfit, feeling stylish and confident.",
            "Head to the bedroom to relax. Enjoy a peaceful night of sleep.",
            "The monkey saw a bunch of bananas, excitedly jumping towards them. After devouring a few, the monkey was finally content."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The forest consists of thousands of trees. Together they absorb carbon dioxide and release oxygen.",
        "choices": [
            "Most birds have two wings. Each wing is specialized to help them fly, providing lift and propulsion.",
            "The forest is made up of many trees. Different kinds of trees provide a diverse environment.",
            "To travel abroad, you must obtain a visa. It's a legal document that permits you to stay in a foreign country for a certain amount of time.",
            "Steve was sad that no one bought his art. He couldn't stop the tears from streaming down his face."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The tooth rests within the mouth. It acts as a tool for mastication.",
        "choices": [
            "The wall stands around the building. It shields the structure from external forces.",
            "She reached up and plucked the orange from the branch, its deep orange colour glinting in the sun. She started to peel it, a burst of citrus filling the air.",
            "A tooth rests in the mouth, among other teeth. It grows secure with the other teeth.",
            "He ran his hand along the chair, rough wood passing under his palm. He needed furniture for his new home."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "These ingredients can include fruits and vegetables. The ingredients are cooked and mixed over time.",
        "choices": [
            "These materials can include dead animals and plants. The material is subjected to heat and pressure over millions of years.",
            "The ingredients are stirred together. The food is created based on the amount of ingredients, time, and stirring.",
            "Clouds are formed from the warm ocean's water vapor being released into the air. Condensation and evaporation continue.",
            "The star starts burning helium. Atoms fuse into heavier elements."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "Place paper in the printer. Send the signal to print out a document.",
        "choices": [
            "Pressing a finger on the keyboard will cause characters to type. Then hit 'enter' to save.",
            "The canoe glides across the lake. People can now cross the lake easily.",
            "Turning on the printer enables you to print documents from your device.",
            "You start to get drunk and stumble onto the ground. You are now lying on the floor."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Fruits ripen. The fruits are dropped into the soil.",
        "choices": [
            "Unprocessed gold is kept in a safe. Coins are made in the minting facility.",
            "Contact is made with a virus. The virus enters the human or animal body.",
            "The bones decay. The bones are cast into the sediment.",
            "The seeds remain fleshy fruits. The fleshy fruit is eaten."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Paint is applied to a canvas. Time passes on and a masterpiece is created.",
        "choices": [
            "Two doors open in opposite directions. At the center of the room, chairs are arranged in a circle.",
            "The soil forms around the body. Time passes on and the rock forms.",
            "A sharp knife cuts its food. A sharp knife holds its food.",
            "Paint, brushes, and a canvas are used to paint a picture. The paint should be mixed and applied to the canvas."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Bombastic words create a turgid atmosphere. The tone is weighted and labored.",
        "choices": [
            "Whimsical phrases fill the air with a capriciousness. Thoughts are light and joyous.",
            "A thick mist shrouded the summit, obscuring her path ahead. She carefully navigated her way up, determined to reach its peak.",
            "The sounds of music wafted through the air, the atmosphere alive with emotion and energy. Nothing could have been more beautiful.",
            "Everything seemed perfect until they found a flaw in the plan. Marshall was there confirming it, realizing it had to be corrected."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "This pattern of gain and loss continues. The stock becomes too expensive to be pushed up by investors.",
        "choices": [
            "Cats sneak up on their prey. Cats pounce and swipe their paws.",
            "The stock market moves up and down, collecting additional investment and growing in value. The large profits are distributed to investors.",
            "Lights up a room. The switch controls the amount of electricity running through the circuit.",
            "This pattern of rising and falling continues. The hail becomes too large to be pushed up by the wind."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "An accident can be a scary experience. Hospitals provide safety and comfort for those affected.",
        "choices": [
            "The enemy forces press forward with great strength. The defending troops realize a retreat is their only option.",
            "One connects to their sense of comfort and safety. They find something familiar to call home.",
            "Death affects us all. Funerals are held to honour the departed and offer comfort to the living.",
            "Fondness creates a feeling of love and warmth. Hatred breeds animosity and despise."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "The timid person shies away from risk and uncertainty. The bold person is unafraid to step out of their comfort zone.",
        "choices": [
            "The car lumbered along the street. Its speed was leisurely and unhurried.",
            "She felt energized by the challenge the game posed. She was in her own world, racing through time and space.",
            "The person shrugs their shoulders, unsure of what to do. Uncertainty starts to take hold of the situation.",
            "Nearby places are easily reachable. Distant places require travel."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Talented performers take the stage. Judges observe and evalute each performance at a dance recital.",
        "choices": [
            "Suspected criminals appear in court, and evidence is brought forth. The judge and jury decide the outcome of the trial.",
            "By pushing the boundaries of their world, they were able to discover new things. Fear no longer controlled their lives.",
            "Writing allows you to express your thoughts. Writing helps to clarify your thoughts.",
            "The cast had gathered in the auditorium, ready to put on a performance of the famed opera. As the music began, each paused to take in the moment."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Bread is generally made of flour. The flour is mixed with other ingredients until a dough is formed.",
        "choices": [
            "If you snore when you sleep, you could wake yourself up. The noise won't stay subdued for long, so better be careful.",
            "A book is usually made from paper. The papers are attached together to form the book.",
            "The doctor is a person specialized in a certain field. They can provide specialist advice to those who require it.",
            "Bread is made from flour and ingredients. The dough can then be shaped and baked into the desired form."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "You play frisbee by catching the frisbee as it moves through the air. This enables you to enjoy playing frisbee with your friends.",
        "choices": [
            "You stop your bicycle by applying the brake. This brings the bicycle to a halt and you can get off your bicycle safely.",
            "She grabbed the cup, cold glass surface sliding through her fingers. She wanted some tea.",
            "He picked up the frisbee and threw it. He was thrilled when he was able to catch it again.",
            "I love music, but I'm getting ready to move my body and dance."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "This waste is not always cleaned up properly. Greenhouse gases can heat up the atmosphere.",
        "choices": [
            "The animal's metabolism decreases. Hibernation can last for several months.",
            "A rock is picked up by the wind. The rock travels further.",
            "Greenhouse gases are gases that can linger in the atmosphere. These gases can prevent heat from escaping Earth's atmosphere.",
            "Rubbish is not always disposed correctly. Dangerous chemicals can pollute the environment."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The engaging scent travels up the nose. The sensation is a reminder of a distant memory.",
        "choices": [
            "The eyes take in the splendor of the scene. A breathtaking moment of clarity is realized.",
            "The sun moved in an elliptical motion, which allowed its full path to be traced with great accuracy.",
            "The puppy grows into a dog. It learns to recognize humans and respond to commands from its owner.",
            "Memories are triggered by senses. The sights, sounds, and smells of the past are remembered."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Rocks are physically and chemically transformed into a metamorphic rock. Rocks are exposed to the atmosphere.",
        "choices": [
            "The plant uses the glucose to give itself energy. Oxygen is released as a by product.",
            "The water turns to steam. The steam turns the turbine.",
            "These rocks can break off and form sediment that reforms. These rocks can be formed together into sedimentary rock.",
            "A caterpillar is physically and chemically transformed into a butterfly. The caterpillar is exposed to the warmth of the sun."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Ideas and thoughts are blended together. New solutions are created from the combined elements.",
        "choices": [
            "The material is melted together. New products are created from the recyclable materials.",
            "The apple starts to spoil. The apple starts to rot.",
            "Grow into new ideas. These new ideas generate new solutions.",
            "Electrons flow through the circuit. Electrons flow back into the battery via the positive terminal."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The electrical current creates a magnetic field around the wire, magnetizing the metal. The magnetic field can be turned on and off by starting or stopping the electricity source.",
        "choices": [
            "A magnetic field is produced by the current. This magnetic field in the wire interacts with certain particles in the central metal part.",
            "Myosin causes the muscle to contract. The contraction of the muscle allows it to move.",
            "The sandcastle will slowly disappear. A large pit will be where the sandcastle was.",
            "A water hose creates a spray of mist around it, cooling the air. The cooling effect can be turned on and off by opening or closing the valve."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Buy products to support a cause. Spend money wisely and use it to help causes that matter to you.",
        "choices": [
            "In order to buy a product, you need to spend money. After spending money, the product is yours.",
            "The soft yellow blanket was spread out on the bed invitingly. The perfect place for a cozy afternoon nap.",
            "She had to make sure the coffee was served hot, or else the customers wouldn't be happy. Mindy took extra care with this task.",
            "Watch the evening news to stay informed. Hear about current events and what’s happening in the world."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "The books are arranged on the shelf. The library is filled with knowledge.",
        "choices": [
            "Water vapor rises in the atmosphere. Water vapor becomes droplets.",
            "The seed sprouts. The roots take hold.",
            "The dishes are arranged so the jets can hit them. The dishwasher is loaded with a cleaner.",
            "Books are placed in a stack on a shelf. Ideas and knowledge from the books seep into the reader's mind."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "She carefully folded the cloth, ensuring it was as clean and crisp as possible. She knew it was time to make the dress.",
        "choices": [
            "On the bookshelf lies a book. It is held in a space specially designed to keep it safe.",
            "She was craving pizza, so she went online to order it. Soon, the delicious smell of her favorite pizza filled her house and she couldn't wait to dig in.",
            "He readied the knife, sharpening it to ensure a precise cut. He was ready to begin crafting the sculpture.",
            "She knew she had to make clothes by hand, as cloth was hard to find. Maggie suddenly realized this was the only way she could survive."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Embracing our sadness gives us insight into our inner struggles and triggers understanding of our emotions. We become more mindful and better equipped to deal with our feelings.",
        "choices": [
            "By finding pleasure in life we are able to focus on all the blessings in our life. We smile, appreciate and look forward to what we have and will receive.",
            "Feelings of joy and sadness flowing together. Emotions intertwining and embracing one another.",
            "Inmates are detained in jail. Prison is the sentence served once inmates break the law.",
            "Bullets scatter across the battlefield. The outcome of the battle is uncertain."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The butter is bright yellow in color. It melts and spreads easily onto toast.",
        "choices": [
            "After having a haircut, short hair feels light and manageable. There is a feeling of freedom.",
            "I wanted to express how funny something was, but instead could only be laugh.",
            "Grasp the knife firmly and spread butter over the toast. Slowly layer on the desired amount of butter.",
            "The flower is soft and fragrant. Its petals open up carefully to the sun."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The liquid in the pool reflects the environment around it. Every ripple creates a beautiful image.",
        "choices": [
            "An employee brings experience and knowledge to the working environment. These skills create invaluable resources for the company and the employee.",
            "Information and knowledge is stored in a digital repository. It refines the understanding of users.",
            "She looked for ways to gain recognition, always hoping to reach the pinnacle of achievement. That was her ultimate desire.",
            "Water is constantly circulated in the pool. The flux ensures the pool remains healthy."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "The container is filled with sea water. The sea water is released into the larger ocean.",
        "choices": [
            "Money is deposited into a bank. The bank's holdings of wealth gradually increase.",
            "Heat is transferred until the room is heated. The temperature keeps increasing until the desired level is reached.",
            "Corals are in the ocean. They use light from the sun to survive and thrive in the salt water.",
            "The air was thick and intense, filled with carbon dioxide and microscopic particles. She had to take a deep breath, her lungs gasping for oxygen."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The glucagon causes stored glucose to be released back to the blood. Blood sugar levels rise.",
        "choices": [
            "The accelerator causes fuel to be released to the engine. The car's speed increases.",
            "Water evaporates from oceans and lakes. Water becomes water vapor.",
            "Cover up the hole. Press down on it.",
            "If blood sugar is too low, insulin levels decline. Glucagon is released by the pancreas."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "He had intense training advocating for the same cause. It was difficult to support and reject what were often conflicting views.",
        "choices": [
            "She joined the corp expecting a challenge. After months of training she became an invaluable part of the army.",
            "She knew she was guilty of deceit. Even so, she didn't care to be fraudulent any longer.",
            "Patience is a virtue and learning it takes practice. Through perseverance and endurance, it is possible to gain a better understanding of how patience works.",
            "They had done their best selling the product, yet customers kept returning it. It was exhausting work."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Ingredients are mixed together to make a cake. Heat is produced as a byproduct.",
        "choices": [
            "Light shines out of the light bulb. The flashlight shines light on whatever it's pointed toward.",
            "The ingredients in the recipe use heat. Transform the ingredients into a delicious dish.",
            "Carbon dioxide, water, and ATP form sugars via the Calvin cycle. Oxygen is given off as a byproduct.",
            "Parents put comfortable things inside the baby's crib. Parents put toys inside the baby's crib."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "To visit another country, travelers must cross borders. It takes planning and resources to travel abroad.",
        "choices": [
            "A new country arose, spreading its borders across the continent. Soon it had grown to encompass the whole land.",
            "He started the grill and put the steak on it. The smell of the marinade wafted through the air as the steak began to cook.",
            "The plant is placed on the windowsill, absorbing light and taking in water. It grows and blooms over time.",
            "Hopping on a plane allows one to explore the world. It's an exciting way to see the world and create memories."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "A person adjusts a buckle on a belt, tightening it to the desired size. The buckle fastens securely, completing the belt.",
        "choices": [
            "A gardener places a plant in the soil and starts to water it. The plant grows, blooming in the garden.",
            "He got down on one knee, holding the ring tightly in his hand. Finally, they said \"I do\" and started their life together.",
            "Animals reared primarily for their meat. People purchase it from the market.",
            "The law aids its people, providing rights and protecting them from harm."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "People choose to emigrate to new countries. It is a journey they must undertake.",
        "choices": [
            "A resilient framework is necessary to protect the structure from harsh weather. Properly built structures can endure any storm.",
            "Taking a step back, individuals reconsider their points of view. It is a retreat from their prior position.",
            "It had taken only a few seconds for the entire landscape to be warped beyond recognition. It seemed like everything had vanished in the blink of an eye.",
            "Citizens flee nation, joining other expatriates from different countries. For them, life as immigrants begins anew."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "A patient enters the doctor's office. The patient is determined to conquer the disease.",
        "choices": [
            "The patient taking the right medication is restored to health. The medicine helps the patient recover fully, healing the cause of their illness.",
            "A warrior steps onto the battlefield. The warrior fears no enemy.",
            "The brain sensed what was around them and interpreted the data. Its neurons working tirelessly to process information.",
            "His friends enjoyed playing games to divert their attention. It never failed to entertain them."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "He hated the crowded supermarket. Instead of shopping, he fantasized about his quiet office, where he had control over his environment.",
        "choices": [
            "Taking a step back, individuals reconsider their points of view. It is a retreat from their prior position.",
            "Microwaves provide intense heat quickly. The heat from microwaves is used to cook food.",
            "The store clerk was accustomed to the busy days in the store. He had developed an efficient system to quickly attend to customers.",
            "She felt energized by the challenge the game posed. She was in her own world, racing through time and space."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Water is a liquid. It can flow and take shape of its container.",
        "choices": [
            "His mind contemplates the reality around him. Thoughts fill his head and help him to understand.",
            "Winter is cold. It chills the air and creates beautiful, frosty nights.",
            "The beach was dotted with colorful beach umbrellas and blankets. The sand was cool and inviting, providing a welcome respite from the hot sun.",
            "Water flows everywhere. It is a liquid with no boundaries."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Hopping on a plane allows one to explore the world. It's an exciting way to see the world and create memories.",
        "choices": [
            "The key fit the lock. The door opened.",
            "To visit another country, travelers must cross borders. It takes planning and resources to travel abroad.",
            "Bob took the chalk and cautiously wrote on the blackboard. He was nervous, but determined to make the perfect presentation.",
            "Planes made it possible to travel quickly to distant places. It was a revolutionary way to explore the world."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Poor people struggle to make money. They often have to work long hours.",
        "choices": [
            "Tired people try to find ways to get energy. Regular exercise can help give them a boost.",
            "An individual with a decreased immune system is more susceptible to illnesses. Too little resistance and even the common cold could become a dangerous health concern.",
            "People support causes they care about. They contribute by giving money and time.",
            "His debt continued to grow, along with the outrageous late fees. He felt unable to keep up and slowly resigned to the fact that he may never pay it off."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "A vibrant oil painting hangs in the hall. A tumult of passionate colours cascade from the canvas, captivating the viewer.",
        "choices": [
            "A wonderfully detailed quilt is crafted. Each stitch is carefully and meticulously crafted, resulting in an exquisite masterpiece.",
            "The journey begins on the road. The road is filled with twists and turns that shape the outcome.",
            "An easel holds the canvas securely for the artist. It allows for a stable work surface and easy manipulation of the painting.",
            "Power can be used to manipulate and control. People may use it to exploit their advantage."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Notes are plucked from the guitar strings, ringing out over the air. The sound travels to the listener.",
        "choices": [
            "Rain droplets fall into the water, mixing and flowing outward.",
            "Take a ride on the back of a horse. The fun moments of the ride will remain in memories for years to come.",
            "Strings are plucked to make music on the guitar. Their sound resonates deep within the room.",
            "Eyes wide open, the yawn signaled that I was awake."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "When you shop, you have money. Your wallet feels a bit lighter.",
        "choices": [
            "When you dream, you sleep. Your mind is lost in an imagination.",
            "The leather is carefully stitched to make a wallet. The wallet holds all of your important cards and cash.",
            "Chickens lay eggs on a daily basis. Eggs provide a valuable source of nutrition for people.",
            "A duck has a web foot for propulsion. The duck is also able to swim using the web foot."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "Write the letter. Fold the letter.",
        "choices": [
            "A snowball rolls downhill. The snowball grows larger and eventually becomes an avalanche.",
            "Choose what you want to write your letter on. Think of what you want to say.",
            "The sediment piles on top of other sediment for a long time. The sediment near the bottom is compressed by the weight of newer sediment.",
            "Cut the fabric. Sew the fabric."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The envelope seals, ready for sending in the post. The letter is all set for its journey.",
        "choices": [
            "He sealed the envelope and took it to the post office. He was happy to send his friend a letter.",
            "Getting a job can be a stressful process. A person must try to demonstrate their abilities and find ways to earn money.",
            "The mast is attached and secured. The sail is ready to be hoisted and set.",
            "The glass is fragile and can easily shatter. Residual pieces and shards could injure someone."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Animals gain weight to store energy for the winter. An animal will slow their breathing and other body functions.",
        "choices": [
            "The fan turns a motor. The rotating motor generates power.",
            "Cars fill up their tanks to store fuel for long trips. Cars will slow down to conserve fuel.",
            "These rocks can slip over many hundreds of years. A sudden slippage of these rocks along the fault line creates massive energy.",
            "The animal's body temperature cools. The animal's breathing slows."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "The food is eaten. Digested by something.",
        "choices": [
            "The factory produces components for products. The factory converts excess materials into spare parts for backup.",
            "The oxygen is inhaled. Used by the body.",
            "Food is drawn into it. Food can not escape.",
            "A photocopy is made of a book. The photocopy is then taken to another location."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "Murphy was a small tabby kitten and full of energy. His owners laughed as he chased a string around the house.",
        "choices": [
            "She took her kitten to the cat cafe for the first time. He meowed and hopped around, making new friends.",
            "A dresser rests in the corner of the bedroom. The dresser provides storage for many items.",
            "Clancy was a golden retriever of remarkable intelligence and loyalty. His owners loved petting and cuddling the joyful pup.",
            "Crime requires justice to be served. A balanced and impartial system must be respected to ensure fairness and justice is achieved."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The pieces that fit together can form puzzles. Puzzles can also be jigsaws.",
        "choices": [
            "The plates that push each other up can form mountains. Mountains can also be volcanoes.",
            "Puzzles can break apart and be put back together. The pieces can be reassembled into a complete puzzle.",
            "Water is added to clay. The hardening process begins.",
            "The sale is removed. The water is able to be drank at this point."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The lake water shimmered in the light, revealing hundreds of fish beneath its tranquil surface. He was in awe of this hidden underwater world, untouched by human intervention.",
        "choices": [
            "The prisoner slowly walked out of the jail, finally feeling free after what felt like an eternity inside.",
            "The water was still, fish barely making a ripple as they swam lazily. A perfect day for some relaxed fishing and soaking in the peaceful atmosphere.",
            "He strummed the guitar, six strings of sound/melody. His passion for music soaring with each chord.",
            "His eyes beheld the vast crater of the moon's surface. It was an astonishing sight, as he marvelled at its grand and sublime scale."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Spot is his loyal pup, she's been following him around. He gives her a bone as a reward for her loyalty and to show his appreciation.",
        "choices": [
            "The tree is essential to the rainforest's ecosystem. It shelters and provides life to many creatures.",
            "His kind words always make her day. Whenever he gives her a compliment, her heart is filled with joy and appreciation.",
            "The puppy happily chewed on its bone, excited for the treat it had been given. Its tail wagging with sheer joy and enthusiasm.",
            "The car is driven down the street. As the speed increases, the car steadily moves along the streets."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "Domestic breeds of animals are selected for conformance. This ensures a desirable outcome for the breeders.",
        "choices": [
            "Buying something of value comes with caution. Everyone must be aware of its quality.",
            "Tedium drags on. Enthusiasm takes its place and brings excitement.",
            "Species evolve in order to adapt to their environment. This ensures that the species can survive its changing environment.",
            "Different breeds of animals are a result of selective breeding. This process deliberately increases desired traits."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The bus driver brings the bus to a stop at the destination. Passengers alight and make their way to their next adventure.",
        "choices": [
            "Money is transferred from one bank account to another. The amount of money which left one account has been received in the other.",
            "The bus is full of passengers. They all get to their destination safely.",
            "Students take an exam to apply their skills to the questions. In the end, students can assess the depth of their knowledge and determine what needs to be studied further.",
            "Voices of dissent are raised. Then, the speaker pulls back on their remarks."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "Wax melts. When the wax cools, it hardens and becomes a candle.",
        "choices": [
            "The magma cools. Crystals form and the magma become igneous rocks.",
            "The woman gives birth to a baby. The baby grows into a child.",
            "The heat turns a candle wax into liquid. The liquid turns a wheel.",
            "Even more tools work together to build a house. Other tools are used from the carpenter and plumber."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "An electric voltage is created. The electric voltage can be collected.",
        "choices": [
            "The owl looks down at the ground. The owls keen eyesight allows him to see in the dark.",
            "Heat accumulates. The heat can be harnessed.",
            "Over long periods of time, the sun can heat metal. And cause a chemical reaction.",
            "Electrical voltage is increased. Electricity is released to electronic devices."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "A smart doctor makes the correct diagnosis quickly. Patients heal sooner.",
        "choices": [
            "The doctor is very smart. She always knows when to prescribe the right treatment.",
            "People visit places to explore and learn. Experiences tied to a location.",
            "A comfortable chair offers good support. People feel more relaxed and able to concentrate.",
            "Strings are plucked to make music on the guitar. Their sound resonates deep within the room."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Food is dumped out of the stomach into the upper intestines. Nutrients are absorbed in the small intestines as a food flows through.",
        "choices": [
            "Air is pulled in through the nose and/or mouth. The air travels down the windpipe.",
            "Water is pumped from a reservoir into a river. Nutrients are filtered out as the water flows downstream.",
            "The  food goes into the stomach and is churned. Food is dumped out of the stomach into the upper intestines.",
            "The trash is placed into a truck. The truck drives to a landfill."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "Someone visits the hospital for treatment. The hospital takes care of the patient until they are well again.",
        "choices": [
            "The card catalog is organized in the library. People are able to find the resources they need by systematically searching through the catalog.",
            "The children laughed as they made their snowman, their hands leaving trails of wet snow in their wake.",
            "Chocolate is the featured candy. It's the most desired taste in the box.",
            "The bed is wheeled into the hospital. Patients get the care and treatment they need."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "The forest is lush and dense, trees tower high. Roots firmly hold the trees in place.",
        "choices": [
            "The bird flaps its wings, the feathers flex with each stroke of wind. Air carries it away from its resting spot, launching it into the open sky.",
            "Flour is blended and kneaded with water to form dough. Heat and steam create a loaf of bread.",
            "A colorful beetle crawled across the damp log, its metallic sheen reflecting the nearby stream's light. Its movements were swift and precise.",
            "The forest has many trees. The trees are lush and plentiful."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Two people come together to start a family, and they get married to seal their bond.",
        "choices": [
            "She took some denim and turned it into jeans. The stylish, comfortable jeans were a perfect addition to her outfit.",
            "Everywhere he presided, he conducted criminal trials with fairness. Upholding justice was his highest priority.",
            "Two people come together to reproduce. They have a child and become a family.",
            "You can't help but be sad, and it shows with every tear you cry."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The coffee bean roasts, its texture and flavor entirely changed from when it had first been picked.",
        "choices": [
            "The pages start to yellow, and the spine of the book begins to weaken with time.",
            "A flute is a woodwind instrument. It produces a beautiful sound when played.",
            "She worked diligently until she became an expert in Java programming. Every day she discovered something new, and her confidence grew.",
            "The coffee is brewed from a single coffee bean. The bean gives off its flavor and aroma."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Information is received through the eyes. The information is processed, understanding the details and gaining knowledge.",
        "choices": [
            "Food is taken in through the mouth. The food is chewed, breaking the food into smaller bits and mixing it with saliva.",
            "Water flows to the reservoir. Water is pumped out of the reservoir to the rest of the town.",
            "Ideas and information is filtered through someone's mind. The ideas and information are returned in the form of knowledge and understanding.",
            "A garden is carefully tended and nurtured. Flowers begin to bloom."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The politician is in the public eye. His decisions and statements are widely scrutinized.",
        "choices": [
            "He took his boat out in the lake, carefully tending to every detail to ensure his match was perfect.",
            "Not a sound could be heard in the quiet park. She was delighted to have it all to herself.",
            "A politician obeys the commands of the president. Every decision is made with thoughtful consideration.",
            "The woman is a power player. Her words and actions have influence."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The chemical medium allows for the flow of charge between the anode and cathode. The device is connected to both ends.",
        "choices": [
            "The star is much larger than it was. The star is a red giant.",
            "Chemical reactions occur on the electrodes. This creates a flow of electrical current to the device.",
            "The electrical wire allows for the flow of electricity between the positive and negative terminals. The appliance is plugged into both ends.",
            "Material is pushed up forming a dome mountain. A tectonic plate goes under another tectonic plate."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "He was an expert at billiards, and amazed his friends with his speed. On his best night ever, he made a record-breaking number of shots.",
        "choices": [
            "Things move slower and slower as time passes. Speed decreases.",
            "He felt a strong sense of obligation, but in the end he knew he would only have regret.",
            "She was a pro at controlling the gas stove, and could get the heating to the right level in no time. That night, she cooked the best meal with impeccable temperature.",
            "Heat energy dissipates through the heated surface of the heating coil. Heat transfer takes place from the coil to the environment."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Embarrassing moments make everyone cringe. An overall sense of discomfort grows.",
        "choices": [
            "A feeling of dreamy restlessness consumed them; they felt pulled by some unknown force. The person searched for an answer, a way to make sense of the feeling.",
            "When the stand-up comedian told the joke, everyone was in stitches - it was so hilarious.",
            "An idea begins to gain traction. To restrict its spread, it is put into a metaphorical prison so people can't take it up and use it.",
            "An unspoken agreement is signalled with a nod. Silence and acquiescence fill the room."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "The opponent showed great articulation in his argumentation; every statement was vibrantly presented. His consultant rejoiced in triumph afterwards.",
        "choices": [
            "She worked hard to cultivate a reputation for being open-minded and willing to understand different viewpoints. In 1843, her rhetoric pushed the idea of acceptance into mainstream thinking.",
            "The soldier displayed extreme precision in his tactic; every maneuver was perfectly executed. His troop celebrated in victory afterwards.",
            "The patient must stay away from anyone outside of their home. They are in quarantine.",
            "He was standing in the conversation, slowly maneuvering his way to success. His opponent’s rhetoric was no match for his logic."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Fragmented rock material accumulates and is buried by more material. Fragments fuse together to form a sedimentary rock.",
        "choices": [
            "The electrical wire allows for the flow of electricity between the positive and negative terminals. The appliance is plugged into both ends.",
            "A male and a female rabbit mate. The female rabbit builds a nest from fur on her chest.",
            "The material can become buried, compacted, and cemented together. The rock is known as a sedimentary rock due to its composition.",
            "Disconnected bits of information accumulate and are layered with new information. Pieces combine and form a complete understanding."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "An animal dies. The animal is buried fast under mud.",
        "choices": [
            "An animal lives a happy life. The animal gets very old.",
            "This electrical current is converted to sound waves through a speaker. The speaker produces sound.",
            "Blend the ingredients together. Place the mixture into a buttered and coated dish.",
            "A leaf falls from a tree. The leaf is quickly covered by a blanket of snow."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "His attacking strategy failed miserably and he was soundly defeated. There was nothing he could do to prevent it.",
        "choices": [
            "When food is consumed, it gets broken down and absorbed by the body, giving it energy through the process of breathing.",
            "Cooking transforms raw ingredients into something much more delicious. The end result is full of flavor.",
            "Buying shares in the market was his strategy. He knew it had the potential for generating long-term wealth.",
            "Despite all the criticism, she chose to accept that she could not change the outcome. There seemed to be no other option."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The air travels into small vessels in the lungs,. The lungs are engorged.",
        "choices": [
            "It is passed through multiple sieves. Impurities are removed from the grain.",
            "Water runs into small pipes in the house. The pipes become swollen.",
            "Germs are spread through an office building. The people become ill.",
            "The oxygen from the air is transferred to capillaries in the lungs. The lungs begin to contract."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "A stream of water is released from the hose. The valve is closed.",
        "choices": [
            "Water flows through a pipe. Water returns to the reservoir via the outlet valve.",
            "Water flows to the pipe. The pipe converts water into steam and heat.",
            "Decisions can be easy or difficult. Decisions break them down to consequences.",
            "A straight beam of light is generated. The flashlight is turned off."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "A person has two ears to listen and pick up sounds. Sounds are heard from afar.",
        "choices": [
            "She needed something to cheer her up, so she decided to turn on the radio and listen to some music.",
            "A person has two ears. Each ear is used to listen to different sounds.",
            "A house has a roof to keep out the rain. Raindrops patters are heard from above.",
            "Olivia was ready to commit perjury in court. If she got caught it would mean certain imprisonment."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "She was determined to reach the peak of the mountain. Exhilarated but exhausted, she began to make her way down.",
        "choices": [
            "Despite his persistence and dedication, he was stuck at the bottom rung of the ladder. With a heavy heart, he accepted his career's failure and looked forward.",
            "The mountain peak is high and daunting. Climbers challenge and surmount the peak.",
            "Vigorous massage fosters oxygenation. It helps with muscle relaxation and softening of tight fascia.",
            "Competitors go head-to-head in a battle of wills and skills. Each person works to become the ultimate victor in their respective competition."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "A room can be tidied. The room can be swept and dusted.",
        "choices": [
            "There are places inside Earth where rock will melt. Melted rock inside the Earth is also called molten rock, or magma.",
            "Trucks carry away garbage. Garbage is broken down in a landfill.",
            "The paper can be de-inked. The paper can be cleaned and screened.",
            "Heat escapes from a room. The room becomes colder."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Monkeys directly gather fruit from the trees through physical processes. Monkeys directly gather honey from the trees through chemical processes.",
        "choices": [
            "The body releases glycogen. Which converts to sugar.",
            "Bacteria directly absorb nutrients from the plant through chemical processes. Bacteria directly absorb nutrients from the plant through biological processes.",
            "Trees and flowers wilt. Birds and animals disappear.",
            "Air is then split into the bronchioles of each lung. Bronchioles have alveoli which are tiny air sacs."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "Aromatic candles scent the room. Unscented ones do not however, and are used for decorative purposes.",
        "choices": [
            "Savory snacks tantalize the taste buds, while sweet treats satisfy the need for something sugary.",
            "He spent days carefully calculating the impacts of his decisions. He knew their consequences could be far-reaching.",
            "Ornaments are used to adorn the room. The decorations make the living space beautiful.",
            "The seedy part of the city is a contrast to the elegant boulevards. Its vibrancy is a mixture of eclectic sights and sounds."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Soup is created with vegetables. The soup is served.",
        "choices": [
            "Soup can be cooked to make it safe to eat. Soup needs to be cooled quickly after.",
            "You put money in an investment account. You watch it grow over time.",
            "Water is fed into a filter to purify it. The purified water is then sent into a household to be consumed.",
            "Vaccines are created from dead antigens. The vaccines are administered."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "When couples have sex, they may make a baby. This baby is their body creating a new human.",
        "choices": [
            "When someone exercises, they start to sweat. This sweat is their body cooling down from the physical activity.",
            "He takes the phone call, hastily picking up the receiver. His voice is eager and excited.",
            "The sex of a child is determined. A baby's gender is defined moments after conception.",
            "Turtles form a protective shell. They use the shell for defense and camouflage."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The corrosive liquid sits on the iron. Over time, the liquid will erode the iron and cause it to rust.",
        "choices": [
            "The iron is treated to be able to use it as metal. It is put through a process of heating and cooling.",
            "An abrasive material is rubbed against the skin. The friction causes the skin to become tender.",
            "The arbitrator needed to act as a judge, carefully listening to both sides of the argument. She saw the clear truth, making a decision that satisfied everyone.",
            "They placed their votes, sure that it would follow through. What followed was a chaotic crisis when the results didn't come in their favor."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "Butter has a place among other foods. It is classified as a food.",
        "choices": [
            "A person gets the cheese they need to make a tasty meal. Fast and easy, they have all their food ingredients.",
            "The piece of cloth is draped around the hanger. The clothes are ready to wear when taken off the hanger.",
            "The visitor couldn't wait to see the surprise inside. They nervously stood outside the door and rang the doorbell.",
            "Dogs are part of a larger group. They are mammals."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Blood enters the kidney. The blood goes to tiny units in the kidney called nephrons.",
        "choices": [
            "Humans need assistance to transfer ideas to others. Humans attract others with incentives like rewards or praise.",
            "Water enters a river. The water goes to small channels in the river called tributaries.",
            "Blood carried into kidney by the renal artery. Nephrons in the kidney filter the blood.",
            "Food leaves the esophagus and enters the stomach. The stomach churns the food."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "The wind is able to blow the seeds off of the plants. The wind carries the seeds through the air to other areas.",
        "choices": [
            "The wind carries the seeds through the air to other areas. The seeds get caught in the fur of animals.",
            "Bacteria enter the body. Bacteria multiply inside the body.",
            "Ideas and information move around the world. Knowledge spreads across cultures.",
            "A boat is launched on the sea. The boat travels to other places on the ocean."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "The bee flies to another area with other flowers. The pollen is deposited in that area.",
        "choices": [
            "Sexual reproductive stage begins. The fruit body releases spores.",
            "A bee visits a flower. The pollen from that flower sticks to the bee.",
            "A paper is chosen to write or type on. You write what you need to on the paper.",
            "A person travels to another country. Ideas and knowledge are shared in that country."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The beast is attacked by an invisible enemy. It's infected by a virus.",
        "choices": [
            "Crime strikes an unsuspecting victim. The criminal is the source of the chaos.",
            "The wall was aging and had a crack, threatening to collapse at any moment. Hannah was there supporting it, hoping to keep it intact.",
            "The virus is virulent and poisonous. It spreads quickly and causes destruction.",
            "The title was necessary to establish ownership over some land. It took lots of negotiations to settle the dispute."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The melody from the flute stirred up memories of past events. Each note was a reminder of a time that now felt distant and faded.",
        "choices": [
            "Linguistics is the study of language. Sounds and meaning are explored.",
            "The meat on the skewer was cooked to perfection. Its tender juices cut through the air like a poignant reminder of her beloved father.",
            "When it came to criminals, the public demanded punishment. Imprisonment became their strict, yet necessary, sentence.",
            "Music soared as the notes climbed the scale, growing in strength and complexity. The crescendo linking through the melody like a golden thread."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Isolation threatened him until he found solidarity. Together they faced the world, undaunted.",
        "choices": [
            "On a lonesome journey, he found companionship. Through friendship, a new world was opened up.",
            "An environment of repression can stifle our emotions, making it difficult to interact with others. Consequently, our quality of life can suffer.",
            "Rebelling against the status quo is an act of independence that many strive for. Taking individual action that diverges from the norm can bring satisfaction and pride.",
            "She felt a burst of glee when she stumbled upon the unexpected surprise. It was truly a moment for her to savor and admire."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "Rehabilitation is used to encourage social and emotional growth through guidance and support. Probation involves ensuring the offender follows specific rules outside of prison.",
        "choices": [
            "Execution is the punishment used to enforce prison laws. Criminals are put to death by a state appointed official.",
            "Punishment doesn't always lead to desired outcomes. Rehabilitation can help offenders change their behavior.",
            "Politicians debate in parliament to make laws. They hold each other accountable and strive to find the best solutions.",
            "An outbreak of a virus has caused an epidemic. It is affecting people in a certain area."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "Dogs are part of a larger group. They are mammals.",
        "choices": [
            "In some places, animals can be legally owned as pets. They can live a long and happy life.",
            "He was thrilled to visit another country, so he decided to get a passport. He was determined to have an incredible journey.",
            "Texas is a large state. It contains many cities and towns.",
            "Butter has a place among other foods. It is classified as a food."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "His bladder felt so full, he'd been holding it much too long. Suddenly, the urge to urinate became too great, and he let go.",
        "choices": [
            "Rapid eye movement is the sign of dreaming. The mind takes command and allows us to explore surreal realms without leaving our bed.",
            "His stomach growled with hunger. He quickly made an order for pizza, eager for his next meal.",
            "Feeling a full bladder and one needs to go to urinate. Maybe one should think before drinking so much.",
            "The lighthouse stood tall at the edge of the shore. It was a symbol of hope in the distant horizon."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "The magma rises to the earth's surface in volcanoes where it cools and hardens. The magma can also solidify blow the surface of the earth.",
        "choices": [
            "A filter removes impurities. It removes unwanted particles in a liquid to create a clean solution.",
            "The pieces that fit together can form puzzles. Puzzles can also be jigsaws.",
            "Magma reaches earth's surface. Lava flows pour out.",
            "Hot air rises up to the atmosphere where it cools and condenses. The air can also cool down and become liquid beneath the atmosphere."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Pressing a finger on the keyboard will cause characters to type. Then hit 'enter' to save.",
        "choices": [
            "Your fingers hit the keyboard to type. Your words translate onto the screen from finger movements.",
            "The fruit ripens, releasing its seeds. The seed is ready to be planted and grow into a new tree.",
            "The seagull perched on the edge of the boardwalk, scavenging for tidbits. He surveyed the shoreline before gliding away, screeching towards the horizon.",
            "Place paper in the printer. Send the signal to print out a document."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Mountains can also be volcanoes. Mountains can be formed from earthquakes.",
        "choices": [
            "New magma is pressured to the surface of the volcano. The volcano bursts through the rock the formed after the last eruption.",
            "The plates that push each other up can form mountains. Mountains can also be volcanoes.",
            "Houses can also be schools. Houses can be built from construction materials.",
            "Fuel is used for combustion. Exhaust gases pollute the environment."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "He was vigilant in keeping the house secure, the yard monitored and safeguarded. He wanted to ensure the security of his family.",
        "choices": [
            "The house is surrounded by a yard. It's the place to relax and enjoy.",
            "The parent was always warning the child of the dangers of the world. He tried to instil the needed tools to protect them.",
            "Glass is; clear and free from blurry hazy spots. It is the perfect window to the world.",
            "He had polished the leather of his boot with care. Gleaming, it was ready to accompany him on his journey."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "An attack is often associated with aggression and confrontation. Resolution requires compromise and effective communication to end the conflict.",
        "choices": [
            "The walls glimmered with quavering silver light. It was a sight that promised a night of fun and surprises.",
            "Aggression can often be pacified. Communication serves as a powerful ally.",
            "The workers in the warehouse worked together in perfect cooperation. They achieved great success through their efforts.",
            "Logic is used to develop rational ideas and arguments. Once a logical conclusion is reached, it cannot be retracted without further evidence."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The magma undergoes changes in pressure. The magma cools.",
        "choices": [
            "Magma flows as lava. Pressure builds up.",
            "Place the tray in the freezer for about two hours. Remove the tray from the freezer.",
            "A balloon is filled with air. The balloon deflates when squeezed.",
            "The air is compressed in a balloon. The balloon deflates."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "An individual with a decreased immune system is more susceptible to illnesses. Too little resistance and even the common cold could become a dangerous health concern.",
        "choices": [
            "Holding the glass tumbler precariously on one finger an example of lack of stability. One small movement and the glass will crash.",
            "He was passionate about archeology and the science behind it. John realized it was the perfect field for him to study.",
            "An excessive amount of body fat can account for obesity. It's both an individual and a public health concern due to its health risks.",
            "The intoxication of the population had increased, as more and more people used alcohol regularly. Nothing could stop it."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Information is encrypted into a code. The code is sent out of the secure room.",
        "choices": [
            "They come out as packages. The packages are shipped to retailers to use to sell products.",
            "A person receives information from a source. The person then breaks down the information and evaluates it in each part of their mind.",
            "The rocket ignites. The rocket blasts into space.",
            "DNA is encoded into mRNA. MRNA leaves the cell nucleus."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "She gets her hair cut into a really short style. She looks amazing with her new hairstyle.",
        "choices": [
            "The book's pages provide a wealth of knowledge, yet sleep is desired more. They set the book down and drift off into sweet rest.",
            "Going to sleep is a way to rest. Time for the body and mind to relax.",
            "She had a haircut, and now she had short hair. She felt so excited to try out a new look.",
            "He hears someone sing a melody. He joins in and sings along in harmony."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "She worked diligently building a playground in the park. She wanted to bring joy and laughter to the children.",
        "choices": [
            "We all need to take a break, to play and have some fun.",
            "He worked tirelessly constructing a wall around the house. He wanted to feel a sense of security and safety.",
            "He questioned what it meant to truly have faith in his God. After much thought, he decided that it was an act of trust and assuredness.",
            "The playground was full of children laughing and playing. The park was bustling with people and filled with the sound of joy."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Ribosomes bind the new DNA molecules. The transcription and translation continue until the DNA is copied.",
        "choices": [
            "Customers approach the counter. The ordering and payment process continues until the transaction is complete.",
            "A button connects two pieces of fabric with a thread. The button securely fastens the fabric together.",
            "Proteins are entered into a phase called transcription. DNA is unwound partially so that it can be transcribed.",
            "The seeds sprout. The seeds start to develop roots."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Anger has its origin from within us. Emotions affect our thoughts and decisions.",
        "choices": [
            "Achieving a faculty position calls for extensive research experience and proven expertise in the field. Proven research skills prove to be an invaluable asset for those seeking a faculty position.",
            "The stoic individual had difficulty expressing emotion. Unable to express their feelings, their emotions were kept tightly guarded.",
            "He was a veracious explorer, always following the trail no matter how hard or unforgiving it may be. He just knew something was at the end, a special surprise he would never forget.",
            "Steak comes from a cow and is a type of meat. Meat is consumed as food."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "She was a traveler, exploring every corner of the world. But every now and then she found an obstacle in her path.",
        "choices": [
            "The traveller embarked on the descent with caution, gradually making his way down the treacherous path.",
            "Animals exhale carbon dioxide as they breathe. The amount of carbon dioxide increases as more animals are present in one area.",
            "The president speaks to the nation. His words bring attention to the public.",
            "Despite the challenges they faced, their love was strong. Every day was filled with a new difficulty to conquer."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "A person's actions are determined by the decisions they make. The decisions revolve around their core values, which are surrounded by beliefs and principles.",
        "choices": [
            "Ideas and opinions are shaped by life experiences. Time and change affects beliefs and principles.",
            "A person passes away. Their legacy and memory live on through those who knew them.",
            "The seeds get caught in the fur of animals. The animals move and lay down on the ground.",
            "The generator uses the spins of the shaft to rotate a rotor. The rotor spins inside the core, which has magnets inside surrounded by wire loops inside."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "He was a veracious explorer, always following the trail no matter how hard or unforgiving it may be. He just knew something was at the end, a special surprise he would never forget.",
        "choices": [
            "She was such a pedant, always walking at the same pace, taking the same route every day. But that day would be different. She was about to discover something new.",
            "Carefully remove the splinter of wood. Dispose of the wooden splinter.",
            "After years of steady progress in a single industry, he was ready for a bigger challenge. He made the jump to a new career and achieved remarkable success.",
            "He was an explorer, searching for new and exciting opportunities. Every day was a journey, and with each step he came closer and closer to discovering the unknown."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "When a person gets angry, their emotions trap them. The emotions prevent the person from calming down.",
        "choices": [
            "When the earth heats up, these gases trap heat. The gases prevent the earth from returning to cooler temperature.",
            "The grown up bird then goes off on their own. That bird then mates with a partner and starts the cycle over with a new baby bird.",
            "The wet ground is important for growth and blooming. As the morning dew evaporates, it brings life to the plants in the garden.",
            "A person's emotions become intense and fiery. Their emotions burst out and become more controlled and solidified as they are expressed outwardly."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "He smeared glue on the wall, watching it slowly go from runny and liquid to sticky and solid.",
        "choices": [
            "She didn't think much of the old floppy disk since they had already been deemed obsolete. When opened, however, she was pleasantly surprised by the precious memories stored within.",
            "She leaned her back against the wall, gripping a pencil tightly. The lead scratched against the paper, a sound that reassured her everything would be alright.",
            "She put a rubber duck in the bathtub, looking as it went from dull and grey to bright and yellow.",
            "The saxophone is a popular musical instrument. It makes melodious tunes."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "Facing too many obstacles in her path, she was ready to give up. But something inside her wouldn't accept those terms.",
        "choices": [
            "The weapon cuts a path through what lies ahead. Obstacles prevent progress from going unchecked.",
            "His father was always there to nurture and guide him. Bestowing upon him life's valuable lessons.",
            "Memories that once seemed so clear have become confused and blurry.",
            "Even with the difficulties he encountered, he refused to waiver in his mission. He reaffirmed his commitment to the cause."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "A vacuum cleaner sucks up dust from the carpet. The dust is filtered out by a series of filters, which allow only clean air to be released.",
        "choices": [
            "A car is filled with gasoline (gas). Someone turns the car on with a key.",
            "Light enters a room through a window. Objects in the room are illuminated by the light.",
            "Lungs draw in air with a pump-like system. The air is processed by small tubes which transmit oxygen to red blood cells.",
            "Dust is filtered by many tiny dust filters called air purifiers. The dirt is stored in the bin as dust."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "After a hard fought battle, the army emerged victorious. They all felt proud of the victory they had achieved.",
        "choices": [
            "The table was bouncing around the room. Every move sent it careening in a different direction.",
            "A feather moves in the wind, rising and falling in an unpredictable pattern. It's light enough that every gust of wind can carry and lift it in a new direction.",
            "The fierce battle has been won. Their victory is celebrated.",
            "After a heated debate, she managed to convince her opponent. She had proved her point, and felt accomplish of her success."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The baby cries out loud. The noise conveys its need for attention.",
        "choices": [
            "The baby let out a loud cry. The baby's needs were met in response to its loud cries.",
            "The person rushes to pay the bill. They feel the urgency of their financial obligation.",
            "The night sky illuminated after the sun sunk. Stargazers admired the array of constellations.",
            "The computer screen is operated with the click of a monitor. It's ability to perform complex functions is the key to its success."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "Water runs into small pipes in the house. The pipes become swollen.",
        "choices": [
            "The air travels into small vessels in the lungs,. The lungs are engorged.",
            "Water flows through a pipe. The water travels down the pipe.",
            "Place pot roast into the oven for the required time. When a meat thermometer inserted into the roast reads the correct temperature, the roast is done cooking.",
            "Plants a tree. Tree withers away."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The earth temperature rises. Global warming occurs.",
        "choices": [
            "When the earth heats up, these gases trap heat. The gases prevent the earth from returning to cooler temperature.",
            "Fallen leaves accumulate on the ground. As time passes, more leaves are added to the heap.",
            "The electrical wire allows for the flow of electricity between the positive and negative terminals. The appliance is plugged into both ends.",
            "A pot of water is heated. The water begins to boil."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "The huge pieces become larger and larger as time goes on. Suddenly, something big is created.",
        "choices": [
            "He had to remember to be patient and take his time. Rushing would make things worse.",
            "They wanted to collaborate in order to reach a common objective. Each one had a different idea of how to achieve it, but agreed to work together.",
            "The critical tasks become more and more important. Suddenly, something vital has been accomplished.",
            "His heart was broken and he felt as if his power was taken from him. He had to learn how to bring it all back."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The lungs have a series of smaller and finer tubes and sacs. Air reaches the smallest and finest air sacs called alveoli.",
        "choices": [
            "A tree has a system of branches and twigs. Leaves grow on the smallest and finest twigs.",
            "Chunks of ice break off. The iceberg reaches warm water.",
            "Eggs hatch. Tiny fish called fry emerge.",
            "Air reaches the alveoli, the smallest air sacs in the lungs. In the alveoli, air passes into the blood within small capillaries."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Watch the pot closely for bubbles. Once the bubbles are forming, the water is simmering.",
        "choices": [
            "Observe the water carefully for steam. Once vapor is rising, the water is boiling.",
            "The body begins to break down nutrients once a person eats food. Carbohydrates among these nutrients will be broken down in to sugar in the form of glucose.",
            "Steam rises through a boiling pot. Air bubbles form and expand, causing lots of pressure.",
            "Electromagnetic induction is created by the rotor spinning. The electricity created goes through a transformer."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "A person bathes in order to feel clean and refreshed. The person's body is rid of dirt and germs through the use of soap and water.",
        "choices": [
            "People bathe in warm water. They use soap to clean themselves.",
            "Meditation can be used to reduce stress levels. It encourages relaxation and can improve emotional well-being.",
            "After a long day, he needed to gather energy for tomorrow so he went to bed early. Sleep was his only savior.",
            "To bring a new life into the world, a couple reproduces. The couple gives birth to their child, ensuring the continuation of the family's lineage."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "One moves a pawn on the chessboard. Everyone gets ready to play chess.",
        "choices": [
            "Vehicles speed up on the lane. People drive on the highway.",
            "He enjoys playing chess. He wants to win.",
            "She booked a round trip ticket for her travels. She was looking forward to the exciting journey ahead.",
            "The forest is lush and dense, trees tower high. Roots firmly hold the trees in place."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The breakwater stretched along the shoreline, the ocean waves gentled by its presence. A calm atmosphere surrounded the beach.",
        "choices": [
            "The insulation lined the walls of the room, muffling outside sound. A quiet atmosphere blanketed the space.",
            "It was thought to be incurable, but he was determined to make a difference. With his intelligence and determination, he found a way through the therapy.",
            "The tide slowly crept in, washing onto the shore of the beach. Waves lapped the sand as the beach sparkled under the sun.",
            "Suffering is the consequence of wrong-doing. Repentance allows us to receive forgiveness."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The negotiator accepted their conditions. He retracted his demands.",
        "choices": [
            "The negotiator read through the contract carefully, ensuring they considered every angle. Ultimately, they found a way to reach an agreement that all parties were happy with.",
            "They declared an action which was condemned. There was widespread disapproval.",
            "The seed lay dormant in the soil until water started to sink in. Before long, a tiny sprout emerged, growing bigger each day.",
            "The team was defeated. They decided to retreat."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Grass and plants dry up and die without the water. Grass and plants that require water stop growing in the area.",
        "choices": [
            "Water flows to plants. Plants absorb the water.",
            "People stop going to the store when there is no food. The store's business slows down and eventually shuts down.",
            "The motor makes the needle of the sewing machine go up and down. The needle is pressed through the piece of clothing at a constant rate.",
            "A rabbit is born via sexual reproduction. The fertilized egg becomes a fetus and is born from the mother."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "This causes a tropical distrubance. The air above the cloud column cools.",
        "choices": [
            "This causes a heated argument. The atmosphere in the room grows tense.",
            "Warm air condenses into cumulus clouds. The cloud grows.",
            "A washing machine filters dirty water. The washing machine removes dirt.",
            "Water builds up behind the dam. A reservoir is formed."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "He found himself at the helm of an entire army, navigating through a perilous mission. He had a lot of responsibility as a general.",
        "choices": [
            "Always querulous, he had a habit of complaining about any issue. His discontent was relentless.",
            "The guide took charge of a difficult expedition. He had to keep track of every traveler, showing leadership under pressure.",
            "The general strategizes the battle plan. Orders are given to troops on the ground.",
            "The yacht is a luxurious boat. It's elegance sets it apart from any other vessel."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "The software suddenly turned off, leaving unexpected issues in its path. They frantically searched for a way to reactivate it.",
        "choices": [
            "The organisation holds the passport for safe keeping. The passport is eventually returned to the rightful owner.",
            "She peered through the cracked window. Suddenly, she was overcome with a feeling of tranquility.",
            "His life was about finding a way to reconcile his past with an uncertain future. He had to chart his own path.",
            "He was falling asleep, his body slowly shutting down its functions. He quickly snapped back to reality, knowing he had to stay alert."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "He sat alone, looking at the other people in the room with their perfect social personas. George realized he didn't belong in this society.",
        "choices": [
            "The couple expresses their pleasure in the bedroom. The couple have sex and affirm their love for each other.",
            "Grip a golf club, take a swing and hit the golf ball. Land the golf ball in the hole in the fewest number of strokes.",
            "His nose was out of place amongst the equally structured faces in the crowd. He felt there was no place for himself in this world.",
            "The house is composed of multiple rooms, connected together. It is a place where people can experience comfortable living."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The garbage truck comes to the house. Workers take the plastic bag out of the garbage can and place it in the truck.",
        "choices": [
            "Oxygen goes to your tissues. Cells use oxygen.",
            "Trash is deposited in a large can or in bags outside of the house. The trash is picked up by workers who put it on a garbage truck.",
            "The mailman comes to the house. He takes the envelope out of the mailbox and puts it in his delivery bag.",
            "Plants revive in the summer and flower in the fall. The plant can lose up to 40% of its height during this process."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "Ideas begin to spread among people instead of staying in a single person's head. The ideas alter opinions, beliefs, and values.",
        "choices": [
            "Hot air rises up to the atmosphere where it cools and condenses. The air can also cool down and become liquid beneath the atmosphere.",
            "A fire hose sprays water at the flames. The water drains out of the hose.",
            "Water begins flowing above the ground instead of dropping into the soil. The water carves away land, plants, and trees.",
            "People spread their ideas and opinions through conversation and social media. Those ideas and opinions take root in new people and grow over time."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Ideas are transformed by exploration into beliefs. The beliefs travel up into the mind.",
        "choices": [
            "Ideas and beliefs that are no longer relevant are abandoned. The passage of time transforms these ideas and beliefs into something new and fresh.",
            "Wood is broken down. Sawdust is released.",
            "The water is transformed by heat into water vapor. The water vapor travels up into the atmosphere.",
            "Clay is exposed to intense heat and pressure. The heat and pressure will mould it into a hard, durable ceramic object."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The conventional methods didn't work, so they had to try something new and novel to solve the case.",
        "choices": [
            "Some animals learn to use camouflage to hide from predators. Those who become better at this are better able to survive and pass on these traits through selective pressure.",
            "The foreword casts light on the purpose of a novel. The novel is composed to engage readers in a captivating narrative.",
            "She mashed the herbs in her mortar with her pestle, methodically grinding them into a fine powder. She worked until she was pleased with the consistency.",
            "The suspect had no credibility so the officers were unable to trust his statement."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Find a suitable launch site. Calculate the amount of force needed to escape earth's gravity.",
        "choices": [
            "Find a suitable parking spot. Calculate the amount of pressure needed to push the car out of its parking spot.",
            "A car is filled with gasoline (gas). Someone turns the car on with a key.",
            "Food contains oxygen which cells convert to energy. Food contains fiber which breaks down into energy.",
            "The star lacks the energy needed to resist the force of gravity. Gravity pulls the star into itself."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "When it came to erasing any mistakes, he opted for rubber. The fine grade gave accurate results and helped him to produce flawless artwork.",
        "choices": [
            "The teacher reads the paper and marks it for content and quality. The paper is evaluated and a score or grade is assigned for the user's work.",
            "He competed in many competitions, always striving for victory. However, he soon realised that there will be times when you lose.",
            "The toe helps move the foot along. It's attached to the bottom of the foot.",
            "He often used a special type of paper to make his crafts. The thickness of the paper and texture of the wood gave it an interesting texture."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Prey animals must protect themselves to survive. Prevention is the key to staying safe.",
        "choices": [
            "People use cages for prevention. No animal can break out.",
            "Logic often leads to understanding. Loss can also lead to discovery.",
            "She scoured through the books, determined to learn more about her nation’s history. A single misstep here would lead her astray.",
            "Victims of crime can avoid becoming a statistic. Education is essential in understanding how to stay safe."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "She tried to assuage him. Her words helped to mollify him.",
        "choices": [
            "The words are garbled and unreadable. The words are both unintelligible and illegible.",
            "The sun desiccates the air. The sun's heat causes dehydration.",
            "The infection had spread widely, the bacteria affecting nearly everyone. Even with treatments, it continued to rise.",
            "Every year, the whole family gathered to celebrate their long-standing traditions. It was a time of joy and cheer that connected them in a special way."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "Throwing the ball involves a combination of strength and dexterity. Properly throwing the ball to the target with accuracy relies on the thrower's skill and technique.",
        "choices": [
            "He took a few steps back and released the ball from his hand. His aim had to be spot on as he practiced his throwing technique.",
            "A thumb tack is sharp, but something even sharper can make it. Steel, diamond and other materials can be used to sharpen a thumb tack.",
            "The forest has many trees. The trees are lush and plentiful.",
            "The double edge razor is carefully sharpened. Delicately running the blade over one's skin helps achieve a smooth and precise shave."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "As the arm moves, it forms a rudimentary gesture with one hand. The arm is able to express a full range of movement and emotion.",
        "choices": [
            "As the person ponders their feelings, they take time to explore and understand those emotions. The person gets to know the emotion in its entirety.",
            "She had never taken her seat-belt off in the backseat, until that one time. No sooner had she unbuckled it, she became aware of the danger she was in.",
            "His left arm is completely weak and can do no work; while his right arm holds the strength of two hands.",
            "Animals make the earth more alive. They add to the diversity of life."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Milk flows gracefully in a glass. Its form changes with each swirl in the liquid.",
        "choices": [
            "The comb rakes through the hair. Particles in the hair are displaced as the comb is moved.",
            "The glass can hold liquid without seeping out its contents. It prevents liquid from spilling and creating messes.",
            "He was always excited when it came to playing sports. He looked forward to every game, ready to have fun.",
            "Jazz weaves through the air. It has a life of its own in the music."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The garbage can is rolled outside. The garbage truck comes to the house.",
        "choices": [
            "Trash is deposited in a large can or in bags outside of the house. The trash is picked up by workers who put it on a garbage truck.",
            "Air rises when it heats up. The air from bodies of water promotes moist, warm air.",
            "The walls and ceiling of a house absorb the heat from a stove. The absorbed heat is converted to warmth.",
            "The suitcase is carried outside. The bus arrives at the station."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "A teacher imparts knowledge to their students. Without the teacher, students will fail to learn the stated facts.",
        "choices": [
            "The teacher educates the students. The teacher shares their knowledge with the student.",
            "Enter the submarine and travel under water. Watch out for obstacles as the submarine moves forward.",
            "The sun radiates, warming your skin. Without protection, your skin can get burned.",
            "The baby starts to feel uncomfortable, realizing their wet diaper. It's time for a diaper change."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Water flows into a reservoir. Water enters the pipes within the reservoir.",
        "choices": [
            "Ideas are absorbed through learning. They pass through the mind on their way to being understood and implemented.",
            "Water flows into a reservoir. The reservoir supplies water to plants.",
            "The air that passes through a filter is very clean. The air that comes out is free of dust, pollen, smoke and other pollutants.",
            "Blood comes into the nephrons of the kidneys. Blood enters the glomerulus within the nephron."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Whenever someone meets another person, they usually shake their hand as a way of saying hello.",
        "choices": [
            "When someone watches a sport, they can often picture themselves running across the court or the field.",
            "She had a long day and wanted a warm dinner. She placed her order online and within minutes, her meal was delivered and ready to be eaten.",
            "Meeting a new person for the first time can make him feel awkward. But he knew he had to put on a brave face and shake their hand.",
            "The scissors snipped away, trimming her locks until her hair was just right. She became the proud owner of a new, short hairstyle."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Human interaction and relationships can be found in old family systems. These relationships are also formed by exchange of ideas.",
        "choices": [
            "Arguments weaken the relationships between people. The relationships eventually fall apart.",
            "A kettle is filled with water. Steam starts to form in the kettle.",
            "Sieves remove larger chunks. Fine powder is left behind.",
            "Wildlife and water can be found in old cavern systems. These caverns are also formed by seeping water."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Unused items are moved to storage. Once a month the storage bins are taken to a donation center.",
        "choices": [
            "The wall develops cracks wide apart. The cracks become more visible with time.",
            "Goes to a grocery store. The items go into the appropriate bins for each type of food.",
            "The trash is moved to outside bins. Once a week the outside bins are moved to the side of the road.",
            "A caterpillar turns into a butterfly. The butterfly mates with another butterfly."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "The atrium contracts. Blood flows from your right atrium into your right ventricle through the open tricuspid valve.",
        "choices": [
            "Oxygenated blood enters the left atrium. Blood goes to the left ventricle.",
            "The crowd will start to disperse. Only a few people remain.",
            "A prism captures a rainbow via sunlight being refracted by each layer of the prism. The light is separated into its component colors.",
            "A muscle flexes. Water flows from a reservoir into a pipe through an open valve."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "She gets out her brush and paints the canvas. With new strokes, the painting slowly starts to form.",
        "choices": [
            "She got up every morning, ready to run. Pushing herself to go further, she was energized by the sweat that poured down.",
            "He sets up the music stand with the music sheets. He starts playing, gradually taking in each note as the song comes together.",
            "With each brush stroke, he felt more alive. He was content with the world he created on his canvas.",
            "He was so scared, he thought he would die. He just couldn't seem to stop himself from hyperventilating."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "The climber slowly moves down the descent. Each move is deliberate and precise.",
        "choices": [
            "The descent was long and challenging. Eventually, the climb became easier.",
            "The traveller wandered up a steep hill, appreciating the view from the summit. As he slowly climbed, his steps became heavy and tired.",
            "The worker moves slowly towards failure. Every step is calculated and purposeful.",
            "Animals use their bodies as weapons to catch their prey. The prey is then and consumed."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The future is determined by your budget. You can plan ahead when you have the means to do so.",
        "choices": [
            "The destination is determined by the amount of fuel available. You can reach your goal if you have the resources to do so.",
            "He turned the amplifier up to maximum, ready for his solo. The sweet music of the violin soon filled the room.",
            "The leader sat down to review the budget, intent on finding ways to reduce costs. They had their work cut out for them, but they rose to the challenge.",
            "She looked in disbelief at the sharp tip of the pointed object. Nothing she had ever seen matched what lay in front of her."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "A minnow evolves into a fish. As it matures, the fish grows in size and strength.",
        "choices": [
            "She sat deep in thought, taking in all the sights, sounds, and smells around her. Suddenly, the answer to her long-time question came to her.",
            "The audience know the rules for the game. They are expected to adhere to them.",
            "The pebble becomes a stone. The stone accumulates layers over many years.",
            "The fish glides through the water, undulating its body and adjusting its fins to move swiftly. The fish is free to swim in the vast blue sea."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "You open your gift and there's a surprise inside. You don't know what to expect, but it brings the element of excitement.",
        "choices": [
            "He eagerly opened the gift, wondering what surprises were in store for him. Excitement fuelling his curiosity and anticipation.",
            "You go to get a haircut and when you're done your hair will be short.",
            "The child was eager to play the game, but the instructions seemed confusing. He looked to his father for help, but the father only smiled.",
            "His heart felt heavy and he felt himself falling back into despair. But he summoned the strength to remain awake, his hope still alive."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "The businessman was wary of his keen competitor. He was ready to go to great lengths to outsmart or counter any move they might make.",
        "choices": [
            "The politician was in sync with the people, winning them over with his speech. His words shaped the crowd's opinion.",
            "The hunter had a loyal enemy determined to end his mealtime. He carried a bow, ready to fire in case the enemy ventured too close.",
            "The businessman was developing a plan to overtake his competitors. He assembled a team to prepare a strategic marketing campaign.",
            "The organ has a driver attached to control it. The driver holds the power to make the organ sound melodic."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "Magma reaches earth's surface. Lava flows pour out.",
        "choices": [
            "Water boils on the stove. Steam pours out.",
            "The Earth gets warmer. Ice caps melt near the North Pole and South Pole.",
            "The magma rises to the earth's surface in volcanoes where it cools and hardens. The magma can also solidify blow the surface of the earth.",
            "The waste product is taken back to the factory. Waste is released from the factory."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Several articles in the newspaper merge to form a whole. The articles are connected by topic but separate entities.",
        "choices": [
            "A group of islands form an archipelago. The islands are related geographically but distinct from each other.",
            "Within the publication, the article begins. The newspaper is made up of multiple articles put together to form a cohesive whole.",
            "Citizens voted on the referendum, believing it would benefit them. In truth, it only enriched those driven by greed.",
            "She applied lotion to her skin, feeling the hydrating effects of the moisturizer. Her skin felt smoother by the minute."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "Bacteria directly absorb nutrients from the plant through chemical processes. Bacteria directly absorb nutrients from the plant through biological processes.",
        "choices": [
            "Pressure causes the sediment to turn into rock. The remains begin to dissolve.",
            "Monkeys directly gather fruit from the trees through physical processes. Monkeys directly gather honey from the trees through chemical processes.",
            "An engine runs on gasoline. Exhaust fumes are released as a by product.",
            "Bacteria in the soil get to the plant. They consume nutrients left in the plant."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "She got up every morning, ready to run. Pushing herself to go further, she was energized by the sweat that poured down.",
        "choices": [
            "You crack open a can of fizzy soda. It's refreshment in a single gulp.",
            "He showed up the first day of school all excited to learn. He wished that each day could be like that one.",
            "Every morning you wake up, you might feel tired and yawn.",
            "The leaves had been rustling on the tree for what felt like ages. Vibrant colors, each one a different shade of yellow and brown."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "Cars are stopped or slowed by traffic signals or speed limits. The cars slow down and come to a stop.",
        "choices": [
            "Traffic lights adjust the flow of cars. Traffic lights can be used to manage the speed and number of cars to prevent accidents.",
            "A house is exposed to a burglar. The burglar enters the house and steals valuable items.",
            "The now cold air is blown into the house. The refrigerant becomes a vapor.",
            "Rain clouds are stopped or slowed by mountains or wind. The rain clouds drop the rain."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "She was too lazy to cook, so she decided to eat out. She chose to go to her favorite restaurant, feeling excited for the delicious meal.",
        "choices": [
            "She was craving pizza, so she went online to order it. Soon, the delicious smell of her favorite pizza filled her house and she couldn't wait to dig in.",
            "His hands moved quickly over the saxophone, the melodic tune filling the air. He smiled as he continued to play, letting the music carry him away.",
            "The falcon flies through the sky, seeing the world from a lofty perspective. It can soar above changes in the terrain.",
            "She was determined to sate her hunger and eat until she was full. She went to her favorite restaurant to get a satisfying meal."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "When the ground started to shake, the grinds rattled and made a noise. Everyone ran outside, scared of an earthquake.",
        "choices": [
            "The earthquake shook the ground violently, the reverberations leaving a catastrophic amount of damage in its wake.",
            "A dog can guard your house against unwanted intruders. They provide a reliable level of security.",
            "When the drink started to cool, the ice began to shake and make a noise. Everyone gulped down their drinks, scared of the melting ice.",
            "He knew he could be very good at something, so he dedicated himself to doing his best. He could feel that success was within his reach."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "A crack in a dam allows water to leak in. The water level rises.",
        "choices": [
            "Set the machine for the size of the load. Set the machine for the amound of washing needed.",
            "Cuts allow that bacteria in. The bacteria multiplies.",
            "People join together in clubs and associations. The rest find other pursuits.",
            "A crack appears in a dam. Water pressure increases."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Soup can be cooked to make it safe to eat. Soup needs to be cooled quickly after.",
        "choices": [
            "The milk can be heated to kill germs. The milk needs to be cooled rapidly after.",
            "Let the soup simmer. Serve the soup.",
            "Once water reaches a certain temperature,. Its energy can only be contained in the form of vapor.",
            "Initiators form the pre-replication complex. Helicases break the hydrogen bonds holding DNA strands together."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The fuel tank empties. The car can no longer run on the gas in its tank.",
        "choices": [
            "Night watchmen use binoculars to scan the area. The watchmen sit on high vantage points and look out for potential threats.",
            "The mass decreases. The red giant can no longer fuse the carbon and oxygen in its center.",
            "Ideas come into a person's head. A plan is created from the ideas.",
            "A car runs on gasoline. The car runs out of fuel when the tank is empty."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Ideas become tangible plans. The plans take shape and come to life.",
        "choices": [
            "Water becomes water vapor in the air. The water vapor rises.",
            "Ideas come into a person's head. A plan is created from the ideas.",
            "A light is turned on. The person who switched on the light looks for shadows.",
            "The melted metal is turned into bars. Becomes material for other products."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The excited dog grabbed the chew bone. The dog spends the next few minutes engaging in playful, manual labor.",
        "choices": [
            "Linda was tired of being bored. To pass the time, she decided to play a game.",
            "A person receives an unexpected compliment. They feel proud, excited, and their confidence grows.",
            "She cast off the ropes, the sea breeze in her hair. The vastness of the wide ocean filled her with a sense of freedom.",
            "The dog had been begging for a bone for days. When it arrived, he did not hesitate and immediately began to chew on it."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "A blanket is a material that can wrap around a person. The blanket can prevent heat from escaping the body.",
        "choices": [
            "Greenhouse gases are gases that can linger in the atmosphere. These gases can prevent heat from escaping Earth's atmosphere.",
            "A blanket traps the warmth in a room. Turning up the heat causes the blanket to become thicker and more insulating.",
            "The bat sends out sound waves from their mouth or nose. The sound waves hit an object.",
            "The refrigerant within the coils absorbs the heat. The refrigerant changes from a liquid to a gas."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "A hunter searches throughout the vast field. The hunter is ready to capture his prey.",
        "choices": [
            "It's a jumbled puzzle with no solution. The text is both incomprehensible and indecipherable.",
            "Technology has a lasting impact on our lives. It shapes our outcomes for the future.",
            "A researcher scours through the complex laboratory. The researcher is looking for a particular answer.",
            "The prey quickly assesses the hunter. It knows it must act quickly to survive."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Ethos embodies a group's shared values. It is a way for them to be unified in thought and deed.",
        "choices": [
            "Pick up the glass shard. Place the glass shard in the bin.",
            "Leaders dedicate a substantial portion of their lives to the interests of those they guide. It's their job to uphold the values of their people.",
            "Humans analyze the features of various organisms. The desired traits are bred into domesticated species.",
            "A code outlines an individual's set of principles. It provides a sense of structure and purpose to the person's life."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The doctor must treat the patient to the best of his ability. He should strive for a successful outcome.",
        "choices": [
            "Each plant stem reached to the sun, in a beautiful symbiosis with the other flora in the garden. Nature worked together in harmony.",
            "She was determined to regale her audience with a captivating story. Taking a deep breath, she began to entertain them.",
            "A patient enters the doctor's office. The patient is determined to conquer the disease.",
            "The debtor must pay what he owes. If not, further action will be taken."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The parent looked at the child with love. The child looked happily back at their parent.",
        "choices": [
            "The plastic material can be molded into various shapes. It is also durable and resistant to corrosion.",
            "A parent loves and protects their child. The parent fulfills their role.",
            "I love music, but I'm getting ready to move my body and dance.",
            "The musician gently touched the violin's string. The string silently resonates to the musician's tune."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Sand and clay cover the peat. The sand and clay form sedimentary rocks.",
        "choices": [
            "The small intestine uses enzymes to further break down the food. The food passes into the colon.",
            "Wetting and drying breaks up rocks that contain clay. Wet clay expands, putting pressure on other rocks, causing them to break.",
            "Flour and eggs come together to make a cake. The cake bakes and forms a delicious dessert.",
            "A forest fire is started in a wooded area. The fire spreads among dry and dead vegetation."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "Rewards are motivational. People are encouraged to do their best when rewarded.",
        "choices": [
            "She had a knack for accumulating wealth, always keeping her eyes on possibilities to further her financial influence. She knew precisely what she required to amass her empire.",
            "Being productive helps us succeed. Working hard leads to great rewards.",
            "Superstitious beliefs are irrational. People often act on them without reason.",
            "The wall is weathered and old. A mighty tree stands tall beside it."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "A person pulls on a rope. The rope turns a spool of thread.",
        "choices": [
            "The ignition pumps a piston. The piston turns a crankshaft.",
            "Cells inside the panel made of silicone convert light to electricity. The electricity is sent to an inverter for conversion.",
            "Food falls from the esophagus. The food goes into the stomach.",
            "A rope stretches and becomes taut over time. Tension builds up on both ends of the rope."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "The toy is activated by the operator's hand. It then moves in the direction in which the operator moves it.",
        "choices": [
            "Citizens are guided by the president's directives. They take the attitude and actions set by the president.",
            "The machine operator panicked as the equipment suddenly broke down. It looked like the entire factory was stopped in its tracks.",
            "The water flow starts to rapidly decrease, eventually emptying the creek.",
            "She presented her argumentation with clarity and intelligence. After a powerful debate, she was convincing."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "Vigorous massage fosters oxygenation. It helps with muscle relaxation and softening of tight fascia.",
        "choices": [
            "Intense aerobic exercise requires lots of oxygen. The body needs extra oxygen to keep going.",
            "Students proudly receive their certificates of completion at the ceremony. They celebrate their hard work with cheers and applause.",
            "His muscles woke up as he stretched, stretching his entire body. His physical capabilities were now fully activated.",
            "The traveller experienced a steep descent. The journey was a difficult and tiring one."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The world was filled with a vast atmosphere, each region holding its own secrets and stories to tell.",
        "choices": [
            "The library was filled with a multitude of books, each one providing a different perspective and knowledge.",
            "People rest when they lie down. They can relax and recuperate from the day's activities.",
            "Billions of lives and stories entwine across the surface of the earth. Our world is an intricate place, full of beauty and surprise.",
            "Set off to explore the trails. Pitch a tent when nightfall comes and sleep beneath the stars."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The liver has an artery for bringing fresh blood from the heart. The liver has a bile duct to drain bile to the intestines.",
        "choices": [
            "The clouds drift across the sky. The clouds eventually obscure the sun.",
            "A fire hydrant has a hose for supplying water. The fire hydrant has a drain to remove waste water from the area.",
            "Animals gain weight to store energy for the winter. An animal will slow their breathing and other body functions.",
            "The liver has a bile duct to drain bile to the intestines. The liver is used to process alcohol, and medications as well."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Watch the evening news to stay informed. Hear about current events and what’s happening in the world.",
        "choices": [
            "The cycle of life includes death, and life is never the same afterward.",
            "Buy products to support a cause. Spend money wisely and use it to help causes that matter to you.",
            "Watching the evening news helps us learn about current events. We stay informed.",
            "Wool is spun into yarn. Yarn is woven into fabric."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "The student applied for a scholarship. With nothing else to depend on, the student was offered the chance to pursue their dreams.",
        "choices": [
            "She had to figure out a way to pass the exam quickly. Mary eventually found a way to understand the lecture and passed.",
            "A professor donated a scholarship to a student. The student utilized the scholarship to further their education.",
            "The traveller ran out of fuel. With nowhere else to turn, the traveller had to depend on the help of others to survive.",
            "Denial is a reaction that people tend to practice when they don't accept the reality. Denial can become an obstacle to personal development if people nurture and sustain it."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "Erosion can be wind or water. Erosion breaks them down to sediment.",
        "choices": [
            "Sediment is produced by erosion from wind and rain. The sediment is carried by wind and water to a new location.",
            "Noise is muffled by the soundproofing. The peace and quiet is returned to the room.",
            "Decisions can be easy or difficult. Decisions break them down to consequences.",
            "The remaining small particles of dust and debris in the vacuum cleaner become waste. Waste leaves the vacuum cleaner and goes into the trash can."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The earth begins to heat up. Pressure starts to form.",
        "choices": [
            "A kettle is filled with water. Steam starts to form in the kettle.",
            "The liquid in the pot boils. Heat from the stove is taken up with the steam as it rises.",
            "Air produces wind pressure. The pressure travels through the atmosphere.",
            "Scoop the coffee into the filter. Set the machine to make a half or full pot."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Canada lies to the north of the United States. The border between them divides them apart.",
        "choices": [
            "The wheel is shaped in a round form. The wheel rotates in its circular shape.",
            "The United States is bordered by Mexico to the south, with several states sharing a border. The two countries interact in many economic, political and cultural ways.",
            "She loved her dog but had to keep him in a kennel outside. On cold days he would curl up and shiver, but he was safe.",
            "He stood by the lake, looking for a fish. Harold suddenly saw one and reached for his fishing rod."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The meat on the skewer was cooked to perfection. Its tender juices cut through the air like a poignant reminder of her beloved father.",
        "choices": [
            "The melody from the flute stirred up memories of past events. Each note was a reminder of a time that now felt distant and faded.",
            "Steak comes from a cow and is a type of meat. Meat is consumed as food.",
            "Coordinate efforts to achieve a common goal. Successfully collaborate as a team.",
            "He watched the phenomena with amazement, as the opposite charges drew the particles closer together. He understood the force that attracts one to the other."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "An excessive amount of body fat can account for obesity. It's both an individual and a public health concern due to its health risks.",
        "choices": [
            "Both sides fight a war, and one side wins the victory. After the war, peace and order is restored.",
            "An individual with a decreased immune system is more susceptible to illnesses. Too little resistance and even the common cold could become a dangerous health concern.",
            "He had a mission to extol the merits of the company. With enthusiasm, he began to praise it passionately.",
            "Unexpected job loss can lead to a decreased income and cause financial struggles. This can have serious impacts on a person's quality of life."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Ideas transform into inventions by scientists in the laboratory. Innovative creations emerge to benefit society.",
        "choices": [
            "Curiosity drives us to explore the unknown. Fearless adventurers discover endless possibilities.",
            "Education is the key to avoiding a harsh sentence. Understanding the law and its implications can help prevent legal issues.",
            "Inside the laboratory is a collaborative effort. Scientists and researchers come together to share ideas and build knowledge.",
            "The society comes to a crossroad. It looks for guidance from its leader."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The window faces outwards from the house. The window reflects the beauty of the outside world.",
        "choices": [
            "The librarian organizes the library. The librarian helps visitors find the book they need.",
            "A window is installed in the house to provide a view of the outside world. It offers an opening to invite in fresh air.",
            "Hair that is too long can start to be annoying and bothersome. Getting a haircut can bring a needed style change and a sense of relief.",
            "Paying cash involves counting out the amount of money needed, followed by getting the change back."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The wind moves across the most birds's wings. The bird is able to take flight.",
        "choices": [
            "Bowling is an exciting game that can be enjoyed by people of all ages. It is also a great way to have fun with friends and family.",
            "The most bird's wings produced a gentle, murmuring flight. Meticulously moving their wings, the bird soared through the sky.",
            "He taught them every lesson with passion, his students always engaged in the classroom. He taught them new concepts and ideas that expanded their vision of the world.",
            "The car audio rattles the speakers. Music comes out from the radio."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Avarice overwhelms a person's desire to be generous. Greed guides their decisions, resulting in the hoarding of resources.",
        "choices": [
            "Placing oneself in jeopardy diminishes one's sense of security. Theft and vulnerability exposes a person to potential threats, making protection paramount.",
            "Money can cause corruption and greed. People may abuse power for their own greed.",
            "The table was too heavy to move. So we got help and carried it together.",
            "The secretary attends all the meetings of parliament, taking notes and ensuring preparation is complete. They are always organized and devoted to their job."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The black ink spreads across the paper. It no longer occupies the same space it was before.",
        "choices": [
            "The ink is put on the paper to make a book. The paper is bound together to form a useful resource.",
            "The sharp tip of the thumb tack punctures the material. The item leaves its own unique mark on the material.",
            "People board the cruise ship for their vacations. They set sail happily with excitement.",
            "On the beach, the players take turns serving the volleyball. They compete until sunset in the sand."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "She was determined to stay the course. Nothing was going to stop her from being resolute and relentless in her pursuit of success.",
        "choices": [
            "He plotted his plan toward the goal, charting a course to reach success.",
            "Lila was an amazing debater; when she received the acceptance letter, it was a dream come true. Her hard work had finally paid off.",
            "Long-term commitment was the only option she could choose. She was ready to face the challenge of enduring and ongoing hard work.",
            "President responds to state affairs. He is a voice of reason and guidance."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "She lacked a solid plan when dealing with a problem. However, she was able to apply her creative thinking to come up with a satisfactory solution.",
        "choices": [
            "She grips the cup between her hands. She lifts it up and drinks its contents.",
            "His insistent knocking vibrated through the walls. Seclusion cloaked his presence as his pleas fell on deaf ears.",
            "He did not have a clear route when travelling. He trusted his instincts to get him to his destination.",
            "Someone faces a difficult problem. They must make a commitment to the solution before they can successfully surmount the difficulty."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The wheel makes the car move. Its constant motion adds convenience to travel.",
        "choices": [
            "The orange has a sweet tangy flavour. The citrus fruit has a bright and colourful peel.",
            "The door opens the house up to the outside world. Inside, anything is possible.",
            "The wheel helps a car move. Without a wheel, the car won't be able to make progress.",
            "A person visits several places. They move around, gathering experiences and creating memories."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "Put the ice cube tray in the freezer. Allow the water to freeze overnight.",
        "choices": [
            "Unwanted items are taken to a landfill. Most of the items are no longer usable.",
            "The spider produces sticky silk from its abdomen. The spider attaches it to objects where it wants to build the web.",
            "Put the dough in the oven. Allow the bread to bake for an hour.",
            "Take they tray out of the freezer. Pop the ice cubes out of tray."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The cell creates new viruses. The animal cell releases the new viruses.",
        "choices": [
            "The virus enters some of the animal's cells. The virus replicates inside of the cell.",
            "A factory produces new toys. The factory ships the new toys around the world.",
            "Water evaporates because of the sun. Water vapor rises into the air as it evaporates.",
            "A flashlight switch is pushed on. The switch makes contact between the contact strips."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "He stepped out of his home and noticed that his boots made the snow walkable. He was ready to start his adventure.",
        "choices": [
            "After months of being secluded on the island, she looked out and saw an endless expanse of water surrounding her.",
            "The snowman is built with snow. It stands tall and strong in the winter day.",
            "The kitchen sink rusts. Its old age starts to show.",
            "She visited the museum, wandering aimlessly through the corridors. Lost in thought and in the hope of finding someone who shared her enthusiasm."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The sun's rays cause plants to grow. The soil becomes moist.",
        "choices": [
            "Meteorites are space rock the hit the surface of the Earth. These rocks must survive intense heat upon breaching the atmosphere.",
            "Water pushes the paddle in the waterwheel. The paddle rotates the axle.",
            "The sunlight is absorbed by the plants. Some of the sunlight is reflected back into the atmosphere.",
            "The heat causes chemical processes. The material becomes a liquid."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Food is prepared for consumption. Its tastes and aromas are delightful.",
        "choices": [
            "People enter their house for shelter. The roof provides a barrier to the outdoor elements.",
            "He held the camera up, focusing the lens. With a click, the perfect picture was taken.",
            "A shoe is crafted to be worn on the foot. Its leather material is soft and comfortable.",
            "Taking a bite, he has some food. He savors the flavor as he enjoys his meal."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The car zoomed along the street at a remarkable speed, moving faster than anyone else in the area.",
        "choices": [
            "The bus swerved around the automobile, trying to avoid a collision. It was crucial to follow the law and stay safe on the road.",
            "The thermometer pointed to a lower temperature, falling faster than any other location in the region.",
            "The car lumbered along the street. Its speed was leisurely and unhurried.",
            "Hold the charcoal in hand. Draw a stunning sketch in the dust."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "Carbon dioxide is removed from the lungs and exhaled. The oxygen is pass throughout your body.",
        "choices": [
            "A ball is thrown towards a wall. The ball rebounds off the wall back to the person who threw it.",
            "The remaining oxygen enters the body. The remaining carbon dioxide is expelled through the mouth.",
            "Fallen leaves decompose over time. Decomposed leaves turn into compost.",
            "Waste is removed from a house and disposed of. Clean air is circulated throughout the home."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Individuals come together to form a community. A change in attitude or values bring about growth or progress.",
        "choices": [
            "Vinegar reacts with baking soda to form a fizzy reaction. The reaction makes the mixture bubbly and acidic.",
            "Put a dishwasher pod or detergent in the machine. Select a wash cycle.",
            "And form together into clouds or fog. Precipitation of rain/snow occurs when wind/temperatures change.",
            "This transformation, called growth, is the alteration of one person into another as a result of changes within their thoughts and behavior. The process of learning and developing will continue until a new individual is formed that is mature and confident."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The filtered sea water is heated to Boiling. The boiling water produces steam.",
        "choices": [
            "Tea is placed in hot water. The hot water produces a fragrant aroma of the tea.",
            "Strum a guitar string quickly. The vibration produces a sound that can be heard.",
            "Water is added to a pot. It is heated up to produce boiling water.",
            "Antibiotics are produced to fight infection. The immune system starts to respond."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "A rip in your shirt causes a few threads to fray. Tape should be applied.",
        "choices": [
            "A seed grows inside of a fruit. The mature plant emerges from the fruit.",
            "The hook loops the thread around another thread. Two threads interlock around the fabric.",
            "A break in your skin causes tiny capillaries to bleed. Pressure should be applied.",
            "The detective can recognize clues based on the evidence presented. With keen observation, detectives use deduction to its fullest."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "The sharp tip of the thumb tack punctures the material. The item leaves its own unique mark on the material.",
        "choices": [
            "The black ink spreads across the paper. It no longer occupies the same space it was before.",
            "The horse breaks into a gallop, its energy carrying the rider away. The horse takes its rider further with each step.",
            "A thumb tack is sharp, but something even sharper can make it. Steel, diamond and other materials can be used to sharpen a thumb tack.",
            "She squealed in delight as she opened a bag of coffee beans. It was her favorite pick-me-up."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Information is absorbed by a student. The knowledge is stored in the student's memory.",
        "choices": [
            "Fish starts as an egg. The egg is hatched.",
            "Some is soaked into the ground as infiltration. This water is stored as freshwater in subsurface rock.",
            "Add cold water. Place the pot on the stove.",
            "A student collects information for a project. The student transports the collected data to a place where it can be used."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "The doctor came to the bedside. He offered words of encouragement and support.",
        "choices": [
            "His favorite pastime was to write stories. He grabbed his trusty pencil and began drafting a new novel.",
            "Getting to the water plant was the only way to get water. She had to journey out and bring back what she needed.",
            "The neighbor often knocks on the door. It's usually a warm, friendly greeting.",
            "The nurse attends to the patient. She provides help and comfort."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Heat is generated. Neutrons smash into the nucleus.",
        "choices": [
            "A house is exposed to a burglar. The burglar enters the house and steals valuable items.",
            "A flame is ignited. Hammer strikes a nail into a piece of wood.",
            "Turn the light on. Wait for a few seconds.",
            "As the protons and neutrons flee it changes elements. The item becomes less radioactive."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "Neutrons smash into the nucleus. Heat is released.",
        "choices": [
            "The refrigerant changes from a liquid to a gas. The compressor compresses the gas, increasing the pressure.",
            "A caterpillar matures into a butterfly. The caterpillar sheds its cocoon.",
            "Fireworks explode in the night sky. Light is released.",
            "As the protons and neutrons flee it changes elements. The item becomes less radioactive."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "He was a glutton, never enough food to satisfy him. He realized eventually that moderation was key to living a happy life.",
        "choices": [
            "Appetite could be lost due to staleness of the food. People would just refrain from eating.",
            "She felt a sense of dread when faced with a difficult situation. But her expectation gave her the hope she needed for success.",
            "She was a braggart, always boasting of her accomplishments. She recognized one day that humility was much more valuable than pride.",
            "Ruth found solace in writing poetry. She often performed her work through recitation in front of an audience."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The hum of machinery was vibrating through the building. The noise was what he needed to focus on the task at hand.",
        "choices": [
            "The fertilizer boosts growth. Plants start to thrive as they absorb nutrients from the soil.",
            "The waves were crashing against the shoreline. The serene sound was a welcome relief from the chaos of city life.",
            "The pope went through his daily routine of faith, prayerfully tending to the flock of God. He called them all his children.",
            "The grounds for the building weren't very strong and gave Jim cause for worry. Eventually, he decided the building was too weak for a sound foundation."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "A snowman is made from frozen snowflakes. Little pieces of snow are packed tightly together.",
        "choices": [
            "Snowmen are created with snow and pieces of coal. Each snowman is unique and charming.",
            "Paper is made from wood fibers. Shreds are produced from chopping the paper.",
            "Whales populate the deep oceans, and are often seen gliding gracefully through the depths. They are a beloved ocean species.",
            "He started to fumble with his wristwatch, eager to tell the time. He felt confident he could do it despite his trembling hands."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "Centrioles separate to move to opposite poles. Metaphase, the chromosomes line up in the center.",
        "choices": [
            "An oven heats up food. A fan forces air up in ducts connected to spinning blades.",
            "The bone is usually set back into place. The bone is locked into place with a brace or cast.",
            "Two doors open in opposite directions. At the center of the room, chairs are arranged in a circle.",
            "Are pulled apart. Telophase, the chromosomes gather at opposite poles."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The heat causes chemical processes. The material becomes a liquid.",
        "choices": [
            "Sound is echoed in a room. Different objects in the room are louder.",
            "Chemicals break down the material. The material moves into the processing tank.",
            "Flowers have stamen (male parts) which produce pollen. This sticky powder must come in contact with the stigma.",
            "The sun's rays cause plants to grow. The soil becomes moist."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "We struggle to understand difficult concepts. Simple explanations help us comprehend them better.",
        "choices": [
            "The son was so quiet that his parents couldn't help but worry. He rarely expressed his true feelings, instead keeping them hidden.",
            "Theories are thought up, reasoning and facts come together. The theories turn out to be rational and thought-provoking.",
            "We need to accept our decisions to move forward. Regret will only cause us to stagnate.",
            "A warrior steps onto the battlefield. The warrior fears no enemy."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "It's hard to find the right attacking position. The goalposts are far apart.",
        "choices": [
            "Memories are triggered by senses. The sights, sounds, and smells of the past are remembered.",
            "The position of the opponent is weakening. Unable to last any longer, they have no choice but to surrender.",
            "The insulation showed signs of wear after being affected by the loud noises of the factory next door. Homeowners replaced it immediately.",
            "It's difficult to defend a claim when others try to criticize it. The arguments become divided and hard to connect."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "A calendar is used to plan and keep track of time. Looking at the calendar helps to remember important dates and occasions.",
        "choices": [
            "Coke is a popular carbonated soda, known for its distinct flavor. It is a favorite beverage among many people and is available in multiple varieties.",
            "Listening to music can inspire a person to dance. A person may be able to lose themselves in the rhythm and sound.",
            "To keep track of time, he had to stick to his calendar. Checking it daily, he hardly ever allowed his schedule to be thrown off.",
            "A round trip ticket offers the opportunity to travel to different places. The experience of the journey can be remembered and cherished forever."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Dreaming is a time for the brain to process emotions. Rapid eye movement occurs during this time.",
        "choices": [
            "He worked tirelessly in the house's yard, making sure every plant was cared for properly. Appearances were important to him.",
            "Playing chess requires strategy to win. Each move must outsmart the opponent.",
            "Going to sleep is a way to rest. Time for the body and mind to relax.",
            "Watching the evening news helps us learn about current events. We stay informed."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "The cat extends its claw to reach out and scratch the scratching post. The action helps keep the cat's claws trimmed.",
        "choices": [
            "The cat sharpens its claws on the scratching post. Its paw pads help it grip the post.",
            "As he glanced at the steak, he thought of his food choice. He was reminded of why he should pursue a healthier lifestyle, from now on.",
            "The window faces outwards from the house. The window reflects the beauty of the outside world.",
            "The green leaves of the plant reach out and grasp the soil around them. The action helps to stabilize the plant's position in the ground."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "He had always wanted to visit the Eiffel Tower in Paris. When he finally arrived, he was filled with inexplicable joy.",
        "choices": [
            "She pressed the button to turn on the TV. She was excited to watch her favorite television show.",
            "The rifle is raised and aimed. The gunner firmly holds onto the trigger.",
            "She had always wanted to learn a new language. When she finally enrolled in her first Spanish class, she felt a sense of accomplishment.",
            "They had arrived in Paris finally. The beautiful Eiffel Tower glistened in the warm sun, and they were amazed."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "A wonderfully detailed quilt is crafted. Each stitch is carefully and meticulously crafted, resulting in an exquisite masterpiece.",
        "choices": [
            "Grandma threaded her needle and began stitching a quilt. She tied a knot and adjusted the thread tightly.",
            "A vibrant oil painting hangs in the hall. A tumult of passionate colours cascade from the canvas, captivating the viewer.",
            "Travellers mark each milestone on the road. They journey forward at a steady pace.",
            "An atom consists of different charges. These charges determine how the atom behaves and interacts with other atoms."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "He studied the history intensely while analyzing his surroundings. His goal was to make a profound impression on his audience.",
        "choices": [
            "She worked diligently on memorizing the script while simultaneously decorating the stage. She wanted the production to look perfect.",
            "An entity takes revenge against another party. Retaliation comes with consequences and should be considered wisely.",
            "When osmotic pressure is exerted, molecules of a substance move from a region of higher concentration to a region lower concentration.",
            "Stepping forth towards success meant he had to sacrifice some of his experiences along the way. But it was a necessary step to reach his goal."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Minerals replace organic material in a process called petrification. Bones may decay.",
        "choices": [
            "Contact is made with a virus. The virus enters the human or animal body.",
            "The bone material is altered. Old minerals are replaced by new ones.",
            "Due to water's weight, it can generate lots of power. Turbines are placed in between dams.",
            "Bad habits replace better ones in a process called habituation. Motivation may decrease."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Rivers and lakes moves sediment downstream. Sediment moves across dirt.",
        "choices": [
            "In the form of sound, these waves bounce off of nearby obstacles and food. Each object gives off a unique sound wave upon return to the bat's ears.",
            "Ideas and information move around the world. Knowledge spreads across cultures.",
            "Air is let into the engine at the same time as the fuel. The piston in the engine moves downwards compressing the air and fuel mixture.",
            "The sediment is picked up again by new wind or water. The sediment travels further."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "He stayed in his room, deciding that it was better to study than to go out. Reading a book kept him curious and inspired.",
        "choices": [
            "A person is composed of many different emotions and thoughts. Different feelings drive the personality of the individual.",
            "She stayed up late, deciding that it was better to chat with her friends than to sleep. Laughing with her friends kept her cheerful and content.",
            "People go to the library to select a book. The book is carefully chosen and brought home to be read and enjoyed.",
            "He gripped the axe firmly, admiring the sharp gleam it had after being newly sharpened. He was ready for the day's work."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "His kind words always make her day. Whenever he gives her a compliment, her heart is filled with joy and appreciation.",
        "choices": [
            "She held the fruit gently, the surface so sweet that the tiniest bite could satisfy her.",
            "A person can make another feel good with kind words and compliments. These uplifting words build another's self-confidence and encourages them.",
            "He squeezed the toothpaste onto the brush, ready to scrub off any plaque. As a dentist, he knew the importance of clean teeth.",
            "Spot is his loyal pup, she's been following him around. He gives her a bone as a reward for her loyalty and to show his appreciation."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Experienced counselors provide therapy to help people change their behavior and outlook. Listening and processing input is essential for progress.",
        "choices": [
            "The therapist patiently listened to the patient, helping him work through his problems. She was determined to get him to process his input in the right way.",
            "He attempts to understand the concept. He strives towards comprehending the idea.",
            "She enjoyed feeding the ducks at the lake, watching them as they ate the food. It was peaceful to watch them go about their day.",
            "People repair data to make sure it functions the way it should. It may take time to get it just right."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "The Bunsen burner is lit. The Bunsen burner enables intricate experiments in the chemistry lab.",
        "choices": [
            "The child learns in school. The child develops skills to use in the world.",
            "Everyone wanted to watch the movie. It was going to be an exciting night.",
            "He lit the bunsen burner carefully in the chemistry lab. It was a daunting task, but he had to be brave to complete it.",
            "The cat pounces on the tiny mouse. Its sharp teeth sink into the prey's fur."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "This magnetic field in the wire interacts with certain particles in the central metal part. The piece of metal becomes magnetized.",
        "choices": [
            "Time shapes a person's character. Habits form over time and gradually become ingrained in a person's personality.",
            "The animal hears the echo. The animal locates the food.",
            "Wire is wrapped around a piece of metal. Current is sent through the wire.",
            "Heat applied to iron attracts certain molecules in the metal. The iron becomes warm."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "To think clearly and critically, you need to stimulate the brain. Using techniques like meditation or stimulating activities help make the most use of your brain's potential.",
        "choices": [
            "To diminish your own hunger, you need to eat. Eating helps fulfill the nutritional needs of the body.",
            "Feeling a full bladder and one needs to go to urinate. Maybe one should think before drinking so much.",
            "He wanted to think less so he distracted himself with activities. But he knew his brain still need attention to grow and develop.",
            "His stomach growled with hunger. He quickly made an order for pizza, eager for his next meal."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The piston moves back up. The spark plug emits a spark.",
        "choices": [
            "The sparkplug ignites the fuel. The combustive force is pushed into the piston.",
            "The slingshot is pulled back. The bow and arrow releases an arrow.",
            "A river flows through a landscape. The river wears away the soil around it.",
            "The end of the bolt is now magnetized and can pick up pieces of iron and steel. If you disconnect the battery the bolt would no longer be magnetized and the pieces would fall."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "He sharpened his axe with a whetstone. The blade glowed silver and sharp.",
        "choices": [
            "The axe is sharpened. The blade of the axe is sharpened until it is razor-sharp.",
            "She stirred the mixture until the yellow butter was a creamy texture. The butter was now ready for baking.",
            "Stoping your bicycle requires you to use your brake. Slowing down is an important part of the process.",
            "The horse breaks into a gallop, its energy carrying the rider away. The horse takes its rider further with each step."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "The phone sits on the desk. It connects the caller to the person they want to speak to.",
        "choices": [
            "The bishop presides over the church. He connects the congregation to the message of God.",
            "He had become addicted to a powerful pill. His poison of choice was cocaine and he could never say no to it.",
            "He heard the ringing from across the room and ran to answer it. Reaching for the phone on his desk, he realized he was too late.",
            "The child holds the toy tightly. The happy child continues to play and explore with the toy."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "He was lost in the darkness, without a familiar signpost. Everything was unfamiliar.",
        "choices": [
            "He held that light so fiercely, as if it was hope embodied. It was sacred to him.",
            "He was misunderstood in the confusion, without the clarity of founded truth. His attempts to explain fell on deaf ears.",
            "The diagnosis pinpoints the course of treatment. It clarifies the best plan of action for the patient.",
            "Fear gripped him as he followed the path into the darkness. He did not know what was ahead of him."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "The audience applauds after each act. The actors feel rewarded for their work.",
        "choices": [
            "He froze. He was on the stage, surrounded by professional actors. Suddenly, he was overwhelmed with fear.",
            "The opponent showed great articulation in his argumentation; every statement was vibrantly presented. His consultant rejoiced in triumph afterwards.",
            "He pondered the consequences of his decision for hours, not completely sure of the right path to take. In the end, he decided to go forward.",
            "People celebrate after a successful event. Individuals are proud of their accomplishments."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "I decided to use the television set. I plugged it in and watched the news.",
        "choices": [
            "He watches the evening news to gain an understanding of what is happening. He turns on the television to learn more.",
            "I saw an old thing at the museum. I wanted to learn about the object's history.",
            "She smoked cigarettes without hesitation, not caring about the consequences. Sadly, she contracted lung cancer and passed away eventually.",
            "The falcon flies through the sky, seeing the world from a lofty perspective. It can soar above changes in the terrain."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "Aggression can often be pacified. Communication serves as a powerful ally.",
        "choices": [
            "An attack is often associated with aggression and confrontation. Resolution requires compromise and effective communication to end the conflict.",
            "Despite her slim frame, she could never seem to gain the desired thinness. She finally accepted her body, the way it was, skinny but healthy.",
            "Eric was inside a round, cozy circle. Sitting close with his friends, he felt at home.",
            "Anxiety can be diverted with mindful moments. Small steps lead to big results."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Oxygen absorbed by small blood vessels. Vessels deliver oxygen to every cell in the body.",
        "choices": [
            "The bird builds a nest. The bird brings food and guards its nest.",
            "Water is taken up by a sponge. The sponge distributes the water to every corner of the room.",
            "Oxygen pressure is increased. Oxygen is released to body cells.",
            "Dead plant matter converts to peat. Peat converts to lignite."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "A request was made for a certain offer. The offer had certain terms and conditions.",
        "choices": [
            "They declined a job offer after learning of an unfair regulation. When the company refused to withdraw the policy, the offer was retracted.",
            "Damage caused by a natural disaster had to be repaired. Repair should be done with supplies, labor and a certain specified time-frame.",
            "A planet follows the direction of gravity. It moves closer to other celestial bodies in its orbit.",
            "A degree is a unit of temperature. The hotter the object, more degrees it has."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "The books enter the library. Librarians further categorize the books.",
        "choices": [
            "The embryo develops into an adult. The adult produces offspring.",
            "The food enters the stomach. Stomach acid further digests the food.",
            "The books are returned. The books are sent to a library.",
            "At a beach, water passes into the ocean within small streams. The liquid water in the streams merges with the ocean."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "These keeps the bone from moving while it heals. The body forms a blood clot around the bone.",
        "choices": [
            "The fire becomes less bright. The fire continues to burn until it is completely extinguished.",
            "An indentation is formed as the land is moved away. The stream erodes  the land until there is a crevice running through two sections of highstone or land.",
            "Glue holds two pieces of wood together. Dried glue forms a protective seal around the pieces of wood.",
            "Healing tissue forms around the broken bone. This joins the broken bones together."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The child is excited to play with the toy. She can't wait to explore the possibilities.",
        "choices": [
            "The child joyfully played with the toy, feeling creative and inspired.",
            "The library was filled with books of all shapes and sizes. Yet together they formed a vast network of knowledge.",
            "The monkey eagerly takes the banana. He devours the treat with joy.",
            "She could feel the boredom as she waited on line. She wished there was something she could do to make it pass quicker."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "You are in need of something but can't find it. Asking for it is the best way to get it.",
        "choices": [
            "He'd always find a way to buy presents for other people. Even when he didn't have money, he'd find a way to get it.",
            "An intricate pattern is painted onto the canvas. The bag is used to hold all of your possessions.",
            "You have lost something and are desperately searching for it. Don't give up until it is found.",
            "He sat down to play a game of chess, determined to win. The pieces moved across the board, his strategies becoming clearer."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Failure after failure felt like a climb. With persistence, the work eventually became simpler.",
        "choices": [
            "The politician passed a groundbreaking piece of legislation. The law changed the course of the nation's history.",
            "The experience of failure washes over. There is no way to avoid it.",
            "The descent was long and challenging. Eventually, the climb became easier.",
            "The negotiator accepted their conditions. He retracted his demands."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "The star is collapsed until it is super dense and tiny. The star is now a black hole.",
        "choices": [
            "An electrical spark causes a fuse to ignite. The resulting explosion propels the rocket forward.",
            "The star is much larger than it was. The star is a red giant.",
            "Spaghetti noodles are boiled until they are soft. The noodles are now al dente.",
            "Plants absorb carbon in the form of carbon dioxide. The plant converts sunlight and water into oxygen and sugar for energy."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "You go to get a haircut and when you're done your hair will be short.",
        "choices": [
            "I want to have long hair, but I'm thinking of getting a haircut.",
            "Teeth break down food as we chew. They help to reduce solid food into smaller pieces.",
            "You open your gift and there's a surprise inside. You don't know what to expect, but it brings the element of excitement.",
            "She opened the box of the new percussion instrument. Her heart filled with joy as she took out the xylophone."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Heated emotions blaze between them. In an effort to end the fight, one of the parties take back their words and apologizes.",
        "choices": [
            "During an argument, people use persuasive rhetoric to try to win the battle. Every word matters in the attempt to argue in their favor.",
            "Placing oneself in jeopardy diminishes one's sense of security. Theft and vulnerability exposes a person to potential threats, making protection paramount.",
            "The enemy forces press forward with great strength. The defending troops realize a retreat is their only option.",
            "Businesses struggle to create jobs despite government incentives. Unemployment remains high, an ever present issue."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Tired people try to find ways to get energy. Regular exercise can help give them a boost.",
        "choices": [
            "He was pragmatic and took a practical approach. He solved his problems efficiently.",
            "The store clerk was accustomed to the busy days in the store. He had developed an efficient system to quickly attend to customers.",
            "Poor people struggle to make money. They often have to work long hours.",
            "Vital energy fuels the body and helps it perform its essential functions. A balanced lifestyle helps to produce and sustain this energy."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Encourage your friends to reach for success. Do not let them be discouraged by the difficulties they may face.",
        "choices": [
            "Relationships also have unforeseen difficulties. Functioning as a team through the hardships is key to mutual success.",
            "Every day is an opportunity to embrace vitality. To truly make the most of each day, a meticulous approach must be taken.",
            "Suggest creative solutions to your team. Command that they keep their goals in sight.",
            "A shy person may lack confidence in themselves. They stay in the background, hesitant to speak up."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Extroverts feel energised in crowds. They are naturally gregarious.",
        "choices": [
            "The station points out the path. It signals which way will lead to the destination.",
            "Her admirer was always in the corner, gazing in awe at her beauty. She preened, knowing how desperately he wanted to impress her.",
            "Agoraphobia causes fear of crowds. Going out becomes increasingly difficult.",
            "Jingoists are loyal to their country. They are overly nationalistic."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Anxiety can be diverted with mindful moments. Small steps lead to big results.",
        "choices": [
            "Aggression can often be pacified. Communication serves as a powerful ally.",
            "The obstacle is daunting but the challenge is embraced. Together, success is achievable.",
            "His depression and anxiety crippled him, leaving him with little motivation. Even so, he continued fighting through each day, hoping for a better tomorrow.",
            "The enthusiast was passionate and full of fervor. Their enthusiasm was infectious."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "She sat deep in thought, taking in all the sights, sounds, and smells around her. Suddenly, the answer to her long-time question came to her.",
        "choices": [
            "A thought come to mind in an instant. The feeling of the thought is felt immediately afterwards.",
            "The heat and intensity of rage surged through his veins. His anger weighed heavily on his mind.",
            "The computer worked endlessly, taking in inputs and processing information quickly. Suddenly, it was able to solve the problem it had been stuck on.",
            "He put no effort into his work, instead lost in a world of obliviousness. His eyes were glazed and his mind somewhere else."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "His description was vivid and lurid—the details of the crime were hauntingly clear. He felt his heart pounding as he told his story.",
        "choices": [
            "The price tag was expensive and exorbitant. He glanced at the designer bag, trying to decide if it was worth its cost.",
            "He was the manager of the store and was responsible for its operations. He kept track of customer satisfaction levels.",
            "The story is condensed into a few short lines. The details are simplified.",
            "The employee was given a product. The employee is prepared to sell it."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The ficus is given a pot to grow in, providing the necessary anchorage and stability.",
        "choices": [
            "The book is placed on the shelf. It remains there, stable and motionless.",
            "The person carefully puts in two small lenses. Their vision is transformed.",
            "A ficus was growing in the pot. It had been there for months.",
            "A pedestrian is walking along the street. With every step they take, they are gaining more and more footing and traction."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The house's yard is full of plants, flowers and trees. So much beauty in one place.",
        "choices": [
            "Shelves of books line the library walls. So many stories in one place.",
            "Gripping a golf club and swinging it helps hit a golf ball. The power and trajectory of the shot is established.",
            "She wanted nothing more than to reproduce, to have a child of her own. She felt instinctually drawn to it.",
            "The garden is cultivated with care. A variety of flowers fill the back yard."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "The stomach mixes acidic gastric juices into the food. The stomach mixes enzymes into the food.",
        "choices": [
            "The food goes into the stomach. The stomach secretes enzymes.",
            "A filter removes impurities. It removes unwanted particles in a liquid to create a clean solution.",
            "An old chest is buried in the ground. The contents of the chest are changed due to the passage of time and the conditions of the soil.",
            "A blender mixes vegetables into a soup. A blender mixes spices into the soup."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "His insistent knocking vibrated through the walls. Seclusion cloaked his presence as his pleas fell on deaf ears.",
        "choices": [
            "She focused on staying silent and in control of her emotions. Still, her environment was noisy and chaotic.",
            "Excitement brings a sense of eagerness and anticipation. Apathy brings a sense of indifference and disinterest.",
            "His laughter echoed through the hallway, yet fear was all he could feel. With a heavy heart and hesitating steps, he walked into the darkness, unsure of what lies ahead.",
            "Her strident calls echoed in the darkness. Loneliness overwhelmed her, a reminder of her vulnerability."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "He showed up the first day of school all excited to learn. He wished that each day could be like that one.",
        "choices": [
            "He had been standing, waiting all day, and he wanted to sit down and rest.",
            "She got up every morning, ready to run. Pushing herself to go further, she was energized by the sweat that poured down.",
            "Most birds have two wings that give them the power of flight. But one bird was missing a wing and couldn't soar.",
            "Every morning you wake up, you might feel tired and yawn."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "Water flows from rivers. Water goes to the ocean.",
        "choices": [
            "The refrigerant changes from a liquid to a gas. The compressor compresses the gas, increasing the pressure.",
            "Write the address in the middle of the envelope. Put the stamp on the top right.",
            "Water flows in rivers. The river water hits rocks.",
            "Urine flows from kidneys. Urine goes to the bladder."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The sun desiccates the air. The sun's heat causes dehydration.",
        "choices": [
            "Exploration fuels curiosity. It helps people to discover the unknown and expand their knowledge.",
            "She tried to assuage him. Her words helped to mollify him.",
            "She slathered on sunscreen to protect her skin from the sun's harsh rays. She was ready to soak up the warm beach air.",
            "Nobody could prepare the person for the loss they faced. Their will to fight and stay strong seemed to be draining away, yet they persisted."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "Vaccines are created from dead antigens. The vaccines are administered.",
        "choices": [
            "Soup is created with vegetables. The soup is served.",
            "Take off the shoe laces. Take off the shoes.",
            "They protect against further infection. Vaccines work by putting dead or weak antigens into the body.",
            "The pressure over time turns the bodies into oil. The oil can be burned efficiently."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The lake was opaque and still. Its depths obscured by a murky darkness.",
        "choices": [
            "The boy is a young human male. He is beginning to develop his own interests.",
            "A car is a complex machine. The machine is crafted to provide ease and mobility.",
            "Diving into the depths of the ocean, the submarine was ready for its mission. Its occupants were about to experience the remarkable beauty under the water.",
            "The glass is completely transparent. It reveals whatever lies behind it without distortion."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The argument was put forward firmly. The convincing argument helped the speaker prove their point.",
        "choices": [
            "The weapon was used successfully. The victorious soldier proudly held their weapon in the air.",
            "The hostile attitude of the people could not be ignored. The bellicose behavior made the situation dangerous.",
            "He wanted to understand the challenges of others. He was a powerful speaker and others were drawn to his words.",
            "The cogent argument has great persuasiveness. It quickly has everyone convinced of the point the speaker is making."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Elastic bands pulled from both sides. Small tears appear in the fabric.",
        "choices": [
            "Certain fabrics like silk wear out quicker than others. If the material is not handled with care, the fabric will not last long.",
            "Tectonic plates underground pull and stretch. Small cracks are formed in the earth's crust.",
            "A crack appears in a dam. Water pressure increases.",
            "In the teenage years the human experiences puberty. Reaches sexual maturity."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "The virus spreads. The virus attaches themselves to cells.",
        "choices": [
            "A rock is dropped in a lake. The rock is covered by sand.",
            "Fire spreads. The flames consume dry wood and other materials.",
            "The virus propagates in the cell. The virus multiplies.",
            "Stress causes a person to become determined and sure of themself. The doubts and fears begin to dissipate."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "A small town sits in the center of the country. It feels safe and protected, surrounded by the country's nature.",
        "choices": [
            "A tooth rests in the mouth, among other teeth. It grows secure with the other teeth.",
            "Turkey is the namesake of an entire country. The country is home to diverse cultures.",
            "Sleep allows us to dream. Dreams provide us with insight and help us process our emotions.",
            "The student carefully reads each word of the book, taking their time to understand the meaning of the text. The student slowly relates to each idea within the pages of the book."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The clues are followed to find the criminal. The criminal is eventually found guilty of their actions.",
        "choices": [
            "Information is gathered about criminals. It helps identify the criminal's motives.",
            "He dropped the apple, and watched as it rolled away slowly. It eventually came to rest at a nearby tree.",
            "The beast gathers strength for the hunt. The beast eventually catches its prey.",
            "The sound travels and is heard far away. The sound is reflected from the walls and creates echoes."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The water was still, fish barely making a ripple as they swam lazily. A perfect day for some relaxed fishing and soaking in the peaceful atmosphere.",
        "choices": [
            "The lake water shimmered in the light, revealing hundreds of fish beneath its tranquil surface. He was in awe of this hidden underwater world, untouched by human intervention.",
            "A mosquito buzzes from one flower to the next. It quickly transports itself from one location to another.",
            "The sky was cloudless, birds soaring high in search of some food. The perfect setting for a mid-day stroll and to take in the breathtaking view.",
            "A bicycle moves along a street. Every journey adds to the overall mileage, slowly adding up over time."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "These puzzle pieces can fit together to form a picture. Solving the mystery also contributed heavily to understanding the story.",
        "choices": [
            "The salty liquid is key for release and evaporation. As the sweat evaporates, it removes heat from the surface of the skin.",
            "These rocks can form together to become sedimentary rock. Ancient tidal flows also contributed heavily to current sediment locations.",
            "Certain types of metal can be melted together and sold for reuse. The scrap metal can often be collected.",
            "The scattered pieces of a puzzle can be arranged and connected together. The puzzle is known as a complete picture due to its arrangement."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "You enjoy a hearty breakfast. You gain the energy you need.",
        "choices": [
            "Eating food gives us energy for our day. Consuming breakfast sustains us and gives us strength to move forward.",
            "Rain falls heavily, overflowing the riverbanks and creating a flood. Water inundates the land and powerfully rushes forward.",
            "The author opened up a blank document and began typing. They soon found themselves enveloped by the rhythm of the words.",
            "You stretch your limbs to the limits. You get an injury."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "She was on the field at the match, determined to win no matter what. Nothing excited her more than the thrill of victory.",
        "choices": [
            "Weighing the food is important to calculate the calorie intake. Keeping track helps people know exactly how much they are consuming.",
            "He was standing on the battleground, slowly maneuvering his way to victory. His enemy’s moves were no match for his strategy.",
            "He was on the frontline at the battle, willing to fight for what he believed in. Nothing scared him more than the prospect of failure.",
            "He was an epicurean, seeking out new and inventive ways to indulge his palate. It was a never-ending search for savory delights."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "The alarm clock signals the person to wake up. The person is then able to start their daily activities.",
        "choices": [
            "The insulin signals the cells to open themselves up. The open cells are then able to accept glucose.",
            "Buy some clothes and other vacation supplies. Go home.",
            "A person enters a room. The person is immediately welcomed by those inside.",
            "You wash the wound. You apply a bandaid or other covering if needed."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "He sets up the music stand with the music sheets. He starts playing, gradually taking in each note as the song comes together.",
        "choices": [
            "She gets out her brush and paints the canvas. With new strokes, the painting slowly starts to form.",
            "She was determined to spot the Crow, a beautiful bird rarely seen in the area. Scanning the area, she spotted it.",
            "The glass is clear, allowing us to see through it. It reveals the secrets beyond its surface.",
            "The music stand helps the musician to hold their music sheets. It provides a rich listening experience."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "A sparkly clean efficiency was immaculately kept. He took pride in his tidiness.",
        "choices": [
            "An enormous estate was kept large and pristine. The whole neighborhood admired its grandeur.",
            "After opening up the mind to therapy, thoughts leads to insights. New perspectives give clarity in life.",
            "Society shifted over its history. Its values changed in consequence.",
            "Her extravagance made simplicity desirable again. She taught me that quality was more important than quantity."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Houses are constructed from large collections of bricks. Wind and rain erode the bricks.",
        "choices": [
            "Glaciers and ice shelves are formed from massive accumulations of ice. Tidal motion weakens the ice.",
            "Buildings are constructed due to modern technology. Machines push stones and bricks up and down.",
            "The seed is planted in the ground. The seed grows into a plant.",
            "Carbon dioxide moves up the windpipe. Carbon dioxide is exhaled through the nose and/or mouth."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The weapon is buried deep in the ground. The weapon is kept out of sight.",
        "choices": [
            "The ambulance rushed through the city streets. Moments later, it arrived at the scene of the rescue.",
            "The weapon was used successfully. The victorious soldier proudly held their weapon in the air.",
            "Letters come together to form a word. The word is legible to those who read it.",
            "Ideas are entrenched in their respective convictions. Opinions are deeply-rooted in their set of arguments."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The eye is located on the face. It allows us to see the world around us.",
        "choices": [
            "The earth is situated in the universe. It is part of a greater system and is constantly influenced by its context.",
            "Eyes are one of a kind. Even if two people look similar, their eyes are never quite the same.",
            "She desires to get fit. She commits to a consistent exercise regimen.",
            "The ball hit the ground and bounced up high. The children cheered with delight as they watched its movements."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "He couldn't get enough of creating stories. Fingers tapping away on the keyboard, he felt the rush of ideas flow.",
        "choices": [
            "His dad wanted to drive them up to the cabin. Together, they set off in the car, its four wheel drive engaged.",
            "He tapped away on the keyboard of his computer, working on a report due the next day. His fingers struggling to keep up with his thoughts.",
            "She never got tired of trying new food. Taking a bite, she savored the flavors and enjoyed the moment.",
            "He wanted an adventurous day, so they hopped in a taxi and arrived in the city. Thomas stared in wonder at the old red telephone booth."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "The rocks break along a fault. The break causes seismic waves.",
        "choices": [
            "Some of the vapor condenses onto tiny pieces of dust that are floating in the air. Forms a tiny droplet around each dust particle.",
            "A person has a disagreement with a friend. The dispute causes emotional waves.",
            "Two rock blocks rub against each other. Rocks break and earthquakes occur.",
            "Place the cake on a flat surface in the oven. Wait until cooked through."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "The bird glided gracefully through the air, looking down at the world below with its strong wings.",
        "choices": [
            "Joan hung her painting on the wall and surveyed her work. She was happy with the results and beamed with pride at her accomplishment.",
            "The bird flapped its wings, soaring through the air. Flying was its only way to explore the world.",
            "The atmosphere of the Earth enveloped the planet, giving it the warm temperatures and air to breathe.",
            "Dogs are a breed of canine. They often exhibit friendly behaviors."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "Glass is given heat. The chunks of glass melt into liquid.",
        "choices": [
            "The dirt gets caught in the treads of shoes. The person walks and the dirt is spread.",
            "Ice cubes are dropped into a glass. The glass is filled with cold liquid.",
            "The plants are given water. The seedlings grow into plants.",
            "Everyone gathers to sing happy birthday. The birthday kid makes a wish."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "The young man had just received his first tuba; he couldn't wait to start playing it. He was finally able to express himself creatively through music.",
        "choices": [
            "The dog picked up a bone and began to chew. The bone became softer and easier to work with as it was chomped by the teeth of the dog.",
            "The smoker fumbled in his pocket and brought out a cigarette. He expertly struck it against the box, producing a spark and bringing the thin stick to life.",
            "He always carried a harmonica with him; it was his favorite way to make music.",
            "The little boy was thrilled to get his first yoyo; he could hardly wait to learn new tricks. He was excited to see the tricks he could do with his new toy."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The calm pool of water allows the reflection of an image. The surface is perfectly still to capture the image without distortion.",
        "choices": [
            "The gentle waves ripple the surface of the lake and reflect the image of the trees. The surface of the water reflects a mirrored image of the world around it.",
            "I'm running low on my medicine. I'll pick it up from the pharmacy soon.",
            "The nurse has to provide care for the patient. The nurse will remain devoted to helping the patient maintain their wellbeing.",
            "She felt so comforted when her best friend gave her a big hug. Her friend's warmth made everything feel better."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The rock is broken down even further. The rock becomes particles which go into the soil.",
        "choices": [
            "The gear of a bicycle is connected to the pedals that rotate the wheels. The process can be used to move faster while riding the bike as long as it is in good condition.",
            "Melted rock eventually cools. Rock pushed back to the surface.",
            "The ignition pumps a piston. The piston turns a crankshaft.",
            "The nutrients are broken down even further. The nutrients become molecules which go into the bloodstream."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Comprehending another's viewpoint is a provocation to challenge one's own beliefs. By doing so, greater understanding is revealed.",
        "choices": [
            "Glaciers are incredibly cold environments, with limited access to heat.",
            "Propaganda is used to spread ideals and principles. People are encouraged to adopt these beliefs and apply them to their life.",
            "Accepting another's perspective increases one's awareness of the multitude of options in life. Awareness leads to a heightened appreciation for the journey of life.",
            "Mentioned previously, the appropriate response was given. The correct decision was made."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "Pour the mixture into the greased pan. Place the pan into the oven.",
        "choices": [
            "Place the pan in the oven for about thirty minutes. Remove the pan from the oven.",
            "The food goes to the small intestine. More enzyme are in the small intestine.",
            "You may use a switch to start the computer. Feed the paper through the printer.",
            "Fill the car's gas tank. Put the key into the ignition and start the engine."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "This process creates a third item of clothing. The cycle continues around the three types of clothing.",
        "choices": [
            "This waste is not always cleaned up properly. Greenhouse gases can heat up the atmosphere.",
            "Moisture is removed from clothing over time. The clothing becomes more tightly packed together.",
            "Unprocessed gold is kept in a safe. Coins are made in the minting facility.",
            "This heat forms a third kind of rock. The cycle continues around the three types of rocks."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "A toy falls on the floor. It is hidden under a blanket.",
        "choices": [
            "The spoon sits in the bowl. The spoon scoops the food and puts the food into the mouth.",
            "A zipper is pulled closed. The metal teeth fasten together.",
            "A plant of animal dies in a watery environment. Is buried in mud and silt.",
            "A heavy blanket can keep a bed warm. The blanket can prevent heat from escaping the bed."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Curiosity drives us to explore the unknown. Fearless adventurers discover endless possibilities.",
        "choices": [
            "His ancient vehicle was no match for the wilderness. He bought a rugged truck, ready to take on any adventure.",
            "Leaders dedicate a substantial portion of their lives to the interests of those they guide. It's their job to uphold the values of their people.",
            "Ideas transform into inventions by scientists in the laboratory. Innovative creations emerge to benefit society.",
            "Knowledge unleashes curiosity. Curiosity drives us towards discovery."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Something builds a bridge. The bridge is sturdy and hardens over time, creating a lasting structure.",
        "choices": [
            "Hair accumulates in the drain. The longer it stays, the harder it is to remove.",
            "The dog jumped excitedly and raced off as soon as the frisbee was thrown. He felt content each time he played with it.",
            "He saw something move beneath the bridge and wondered what it could be. He slowly moved closer to take a closer look.",
            "His body was crippled and he only had the use of one arm. Still, he learned how to do things with one hand."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Get some paper and pens. Write the letter.",
        "choices": [
            "Get some paint and brushes. Paint the picture.",
            "You get a piece of paper. You write your letter.",
            "An idea takes root. The concept spreads and grows.",
            "The sale is removed. The water is able to be drank at this point."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The cat jumps up onto its owner's lap. The cat is content to purr and stay in their warm arms.",
        "choices": [
            "The person is conscious of the world around them. They can feel a sense of connection to everything.",
            "Lucid dreaming allows the dreamer to maintain conscious control. The dream feels real and yet becomes a playground of possibility and adventure.",
            "The cute cat meowed for attention, batting at his owner's arm with its paw. The owner couldn't help but love it.",
            "Milk is placed in a fridge, keeping it at an optimal temperature. Milk stays fresh and retains its nutritional properties."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "People are oftentimes put in jail or prison. Being confined serves as a way to keep society safe.",
        "choices": [
            "Society must remain separate from any criminal suspects. This is the purpose of a prison.",
            "Reports of unusual sightings were coming in from all over. Most were easily dismissed, but some left everyone scratching their heads with curiosity.",
            "Place an item in a cage to quarantine. It serves as a means of protection from harm.",
            "The mercenary followed orders without question, driven by the allure of money and power. He was stoic and professional as he set out to complete his mission."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The paper can be de-inked. The paper can be cleaned and screened.",
        "choices": [
            "A paper is chosen to write or type on. You write what you need to on the paper.",
            "People spread ideas and opinions. People influence and persuade others.",
            "The caterpillar forms themselves into a chrysalis. Inside the pupa, the carterpillar forms.",
            "A room can be tidied. The room can be swept and dusted."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Someone reads a magazine to gain new knowledge. The articles teach them important facts that they didn't know before.",
        "choices": [
            "You read a magazine to learn information. You broaden your knowledge in the process.",
            "Some cars are very expensive. Owners take great care of them.",
            "They tune their radio to the right frequency to catch their favorite program. Through the broadcast, they gain information and entertainment.",
            "The Earth sits amidst an ever-expanding universe. Its location is integral for continued existence."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "He held the umbrella up against the icy winds. White snowflakes settled in the edges, forming a beautiful contrast of colours.",
        "choices": [
            "The flowers had started to bloom, their growth a beautiful symbol of symbiosis. Every organism was dependent on the other.",
            "She was mesmerized by the beauty of the simple vase. Its delicate petals nestled in soft pink and purple flowers, creating a stunning display.",
            "The calm lake shimmers under the intense light, the blue colour of its surface rippling as a gentle breeze passes.",
            "He surveyed the grounds for the new building, ensuring there wasn't a single crack in the foundation. It needed to be perfect."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "She knew she needed to be informed about current events. So every morning, she read the newspaper to stay up to date.",
        "choices": [
            "She always tried to watch the evening news, eager to learn about the current events. Staying up-to-date was important to her.",
            "She was determined to learn French. So she actively practiced using language lessons every day.",
            "Wrongdoings take away someone's life. Killing is unjust and inflicts sorrow.",
            "The gun held a single trigger, capable of unleashing an abundance of power with a single squeeze."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "Drugs deplete the body of essential vitamins and minerals and release toxins in the body. Makes it hard for the body to take in nutrients.",
        "choices": [
            "The clouds release water in the form of precipitation. The cycle starts again.",
            "Creatures die. The remains fall into the soil.",
            "Robs the soil of essential nutrients and releases aluminum in the soil. Makes it hard for trees to take up water.",
            "Minerals and vitamins are taken in through food. The body processes the nutrients and energy."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Water is drawn into a hose. The water travels through pipes to different parts of a building.",
        "choices": [
            "Water evaporates because of the sun. Water vapor rises into the air as it evaporates.",
            "A shopping list is created. Groceries are purchased according to the list.",
            "Water goes into small pipes in a house. These pipes can extract potable water from the source and release back waste water.",
            "Air is taken into the body via the trachea, or windpipe. The air travels into small vessels in the lungs,."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The knight held his sword high as he marched through the town, plundering the citizens of their belongings. His harsh laughter echoed through the street.",
        "choices": [
            "The man sings loudly in the street. The man's voice echoes off of the buildings around him.",
            "She felt fear as the knife was held to her throat. His menacing laugh filled the room before he thrust it forward.",
            "The book was slowly flipped through. Every word was read carefully.",
            "The gorilla is a popular species of ape. It is easily distinguished by its large size and black fur."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "Data is organized into a proposition. Different ideas are tied together to form a valid conclusion.",
        "choices": [
            "The flower withered in the sun, its petals trembling. She desperately wanted it to blossom again.",
            "Your opponent looks ready to argue. You prepare your rebuttal for the debate.",
            "Logic is used to develop rational ideas and arguments. Once a logical conclusion is reached, it cannot be retracted without further evidence.",
            "The foundation is set with a strong framework. It ensures a secure place that can handle much weight."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Humans evolved as bipeds, walking on two legs. This allows for long distance travels.",
        "choices": [
            "Submarines are designed to travel in the water. Their mobility gives them great nautical ability.",
            "Read a book. Write down ideas about the story.",
            "She saw a red light ahead and instinctively stopped car. She quickly stepped on the brake, coming to a complete stop.",
            "You sit down when you need to rest. Your legs get a break from the walking."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Ideas are absorbed in the mind. The student starts to understand after engaging with the teacher.",
        "choices": [
            "Space exploration has captured the world's attention. Its discoveries are boundless.",
            "The warrior marched bravely in the battle. He was determined to win the battle against all odds.",
            "Food is broken down in the digestive tract. It becomes nutrients for the body.",
            "The teacher guides the student. The student learns from the teacher's wisdom."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Pray with sincerity and kneel down in faith. The act becomes a regular practice.",
        "choices": [
            "She never stepped foot out of the house without a bucket in hand. It was her go-to bucket to carry any kind of liquids.",
            "He questioned what it meant to truly have faith in his God. After much thought, he decided that it was an act of trust and assuredness.",
            "The knife slices the butter into slivers. The butter is spread evenly across the toast.",
            "I commit it to memory and repeat it daily. I remember the lesson for a long time."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The team was defeated. They decided to retreat.",
        "choices": [
            "The negotiator accepted their conditions. He retracted his demands.",
            "The guests arrived with an excited anticipation, expecting a grand party. But the host had a surprise even greater - she had cancelled the celebration altogether.",
            "The coach guides the team to their ultimate destination. The team makes sacrifices to reach their goal.",
            "She worked hard to extricate herself. Finally, she tasted true freedom."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The temperature drops. The water freezes in the cold.",
        "choices": [
            "A match produces a spark (fire). The spark ignites the fuel.",
            "The light dims. The darkness creeps in.",
            "Spring arrives. Flowers start to bloom.",
            "Once the water temperature is rising. Observe the water carefully for steam."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "She placed the pan on the stove to heat up the food. The hot oil sizzled, filling the kitchen with an inviting aroma.",
        "choices": [
            "The roller coaster had ups and downs. It provided a great source of entertainment and fun.",
            "He brought a pan from the kitchen and placed it on the stove. He was looking forward to making some delicious food.",
            "He started the grill and put the steak on it. The smell of the marinade wafted through the air as the steak began to cook.",
            "She admired the fedora in her hands, the soft brown leather and beige ribbon a delight to her eyes. She was filled with joy at the sight of this beautiful hat."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "The new thing was that she liked it more than she had liked the old. She found excitement in the unknown.",
        "choices": [
            "The vaccine works to eradicate the virus within the human body. The virus disappears after being injected with the vaccine.",
            "The strange thing was that he liked it more than he liked being normal. He found joy in the unfamiliar.",
            "The sudden spending spree causes an economic depletion. It leads to escalating levels of poverty.",
            "Tedium drags on. Enthusiasm takes its place and brings excitement."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "The plastic material can be molded into various shapes. It is also durable and resistant to corrosion.",
        "choices": [
            "The fabric's texture is both soft and supple. It can also be easily dyed to create unique patterns.",
            "Plastic is a synthetic material that has many uses. Plastic is seen everywhere and is a strong yet versatile material to work with.",
            "The tourist stepped off the plane, eager to explore the city. A sense of adventure overwhelmed them as they took their first steps into the bustling metropolis.",
            "A machine gun can kill a person instantly. Bullets hit with speed and force."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "By finding pleasure in life we are able to focus on all the blessings in our life. We smile, appreciate and look forward to what we have and will receive.",
        "choices": [
            "The scientists noticed an alarming bacterial mutation, resulting in crops dying all over the fields. Without a solution, the crops would be lost forever.",
            "She knew it was a blessing to experience such pleasure. Every day she thanked the universe for this joy in her life.",
            "Heating the substance follows thermodynamic principles. Heat is exchanged between objects until equilibrium is restored.",
            "Embracing our sadness gives us insight into our inner struggles and triggers understanding of our emotions. We become more mindful and better equipped to deal with our feelings."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "Working for money gives you something tangible. Handling money and feeling tangible rewards.",
        "choices": [
            "Every night, he made sure to open the books and study. Passing his classes was a priority, so he worked hard.",
            "He was excited to get paid for working for someone else. With his newfound money, he felt relieved.",
            "She sifted through the sand, searching for something very small. Trying to find it was an almost impossible task.",
            "Trying to remember a phone number. Entering the digits when you want to call someone."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The eyes take in the splendor of the scene. A breathtaking moment of clarity is realized.",
        "choices": [
            "The engaging scent travels up the nose. The sensation is a reminder of a distant memory.",
            "Artificial environments are created for domesticated organisms. Life is controlled and adjusted for the creatures.",
            "A person's opinion on a topic changes as they are exposed to different sides of the issue. The person formulates new thoughts and ideas.",
            "The sun illuminates the vastness of the ocean. Its tranquil beauty grabs the attention and offers a moment of calm to admire."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "Plants and animals grow and reproduce. The population size gets larger and larger.",
        "choices": [
            "Air goes through all the little branches in your lungs to fill up the air sacs, or alveoli. Oxygen goes through the walls of the alveoli and into the capillaries.",
            "The plants and animals have shorter, less healthy lives. The plants and animals do not reproduce very well.",
            "Condensation and evaporation continue. The cloud columns become bigger and higher.",
            "A jigsaw puzzle is laid out. The puzzle pieces are sorted and arranged."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "Place an item in a cage to quarantine. It serves as a means of protection from harm.",
        "choices": [
            "People are oftentimes put in jail or prison. Being confined serves as a way to keep society safe.",
            "The shield defends against any danger coming its way. It works to protect its holder from any harm.",
            "The music was fun and the atmosphere was cool. As the night went on, Alex felt more and more alive.",
            "To address poverty in the region, the government provided a plan for action. It allowed for great benefit to the local communities."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "A television program begins. We can watch with excitement.",
        "choices": [
            "A doctor listens with a stethoscope. The doctor can make an accurate diagnosis.",
            "A person takes a kite out of a bag. The person goes outside to fly the kite and is met with a gust of wind.",
            "He had given up on finding the usenet newsgroup, until he realized he had used the wrong usenet provider. With a wave of relief, he quickly switched to find what he was looking for.",
            "He wanted to use the television so he plugged it in. Its colorful images ignited his enthusiasm and excitement."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "The earth is connected to the universe by gravity. The gravitational forces keep it in orbit and make the universe balanced.",
        "choices": [
            "Drawing the water and deciding on the right temperature takes effort. Once the bath is ready, you can relax and enjoy it.",
            "The moon is an object in the universe. It revolves around Earth in a lunar orbit.",
            "Water flows everywhere. It is a liquid with no boundaries.",
            "The eye is connected to the head by muscles which help it to move. This allows the eye to focus on different places."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "After a female bird lays her eggs, the eggs are carefully incubated to maintain temperature and humidity. Once they hatch, the chicks emerge.",
        "choices": [
            "An egg incubates and hatches into a baby bird. It develops into a fully grown bird with time.",
            "People strive to uphold justice in their daily lives. One way is to honor others with respect and fairness.",
            "Bees travel from flower to flower, carrying pollen with them. This process helps flowers to develop and bear fruit.",
            "She was so scared of facing her fears. But with help and support, she eventually gained the courage to take the necessary steps."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Comb through your hair with a brush. Add styling product.",
        "choices": [
            "Bacteria in the soil 'fix' nitrogen for plants. The nitrogen is placed back into atmosphere by the plants.",
            "The tree blossoms from a seed. The tree grows taller.",
            "Skin lotion weakens the skin by washing away the protective layer. Skin lotion gets washed off into the drain and causes the water to become soapy.",
            "Mix flour and baking soda with a whisk. Add sugar."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The public decides who should lead. The president is chosen.",
        "choices": [
            "Two rivals compete in a race. One will be victorious.",
            "The president speaks to the nation. His words bring attention to the public.",
            "The criminal seemed untouchable. But the police managed to catch and arrest him, thanks to their hard work and determination.",
            "People are captivated by the performance. The oil keeps the lighting bright."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "His eyes beheld the vast crater of the moon's surface. It was an astonishing sight, as he marvelled at its grand and sublime scale.",
        "choices": [
            "The person was becoming colder and colder. They put on more clothing to get warm.",
            "The Earth has one natural satellite, the moon. The moon can be seen from the Earth's surface due to its proximity.",
            "The chess board is made up of 64 squares. The squares can accommodate up to 32 pieces.",
            "The lake water shimmered in the light, revealing hundreds of fish beneath its tranquil surface. He was in awe of this hidden underwater world, untouched by human intervention."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "The earth is situated in the universe. It is part of a greater system and is constantly influenced by its context.",
        "choices": [
            "He had to be ready to play the game, so he needed to learn the rules. He had to understand them before the match started.",
            "The eye is located on the face. It allows us to see the world around us.",
            "Japanese food such as sushi is considered a delicacy all around the world. It serves as a representation of Japanese culture.",
            "The Earth sits amidst an ever-expanding universe. Its location is integral for continued existence."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "random",
            "noun"
        ]
    },
    {
        "source": "The soldier displayed extreme precision in his tactic; every maneuver was perfectly executed. His troop celebrated in victory afterwards.",
        "choices": [
            "His troops emerged victorious from the battle. After the enemy laid down weapons and surrendered, the victory was his.",
            "He was known to be fervid and passionate, while those around him were dispassionate and unmoved. In an instant, he made up his mind to act.",
            "Each plant stem reached to the sun, in a beautiful symbiosis with the other flora in the garden. Nature worked together in harmony.",
            "The opponent showed great articulation in his argumentation; every statement was vibrantly presented. His consultant rejoiced in triumph afterwards."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "The seed is nourished by nutrients in the ground. The seed sprouts.",
        "choices": [
            "Planting a seed in nutrient-rich soil. The seed sprouts and takes root in the soil.",
            "The apprentice is educated by the master. The apprentice gains knowledge and experience.",
            "Begins to grow and develop through infancy and childhood. In the teenage years the human experiences puberty.",
            "Glass is given heat. The chunks of glass melt into liquid."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "The employee was an exemplary worker, dedicated to their tasks and loyal to their employer. Their commitment was never questioned.",
        "choices": [
            "The employee was given a product. The employee is prepared to sell it.",
            "Sean magnified his view of the microscopic atom, exploring the significance of the nucleus.",
            "His almanac always sat in the same spot his bookshelf. He often speculated on the secrets it kept.",
            "The servant followed their master's orders faithfully. Their strict obedience ensured the smooth running of their household."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "Holding the glass tumbler precariously on one finger an example of lack of stability. One small movement and the glass will crash.",
        "choices": [
            "A student receives a scholarship to attend a chosen class. The knowledge they will gain is invaluable.",
            "An individual with a decreased immune system is more susceptible to illnesses. Too little resistance and even the common cold could become a dangerous health concern.",
            "She carefully poured the liquid from the cup, watching as it spiraled down into the center of the glass. Satisfied, she smiled and nodded at her work.",
            "Information is gathered for an arrest. The information is used at a trial for the accused."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "She added a bit more seasoning to the dish, hoping it would help kick-start her digestion. The scent of spices filled the kitchen.",
        "choices": [
            "People leave a trail of chaos and destruction as they go about their day. The law serves to uphold social order, punishing those who break it.",
            "She sang an exquisite ballad, mesmerizing everyone with her beautiful song. It was a melody they would never forget.",
            "She loved to cook, creating different dishes in the kitchen. The smell of the herbs, spices, and sauces filled the house.",
            "He thought carefully about the novel's contents, trying to parse out every nuance of its words. The text was full of intellectual provocation."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Playing chess requires strategy to win. Each move must outsmart the opponent.",
        "choices": [
            "Dreaming is a time for the brain to process emotions. Rapid eye movement occurs during this time.",
            "You take a match out and strike it against the box. Light from the fire appears.",
            "He loved playing chess and always aimed to outwit his opponents. But this time, he managed to win the game.",
            "I opened the cutlery drawer, carefully selecting the store knife that was correctly weighted and the perfect size."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The person rushes to pay the bill. They feel the urgency of their financial obligation.",
        "choices": [
            "The baby cries out loud. The noise conveys its need for attention.",
            "Praying was her evening ritual. She paused to take in the moment as she kneeled down and clasped her hands together.",
            "Having someone agree with your opinion is great. Seeing the other person nodding in agreement makes you feel appreciated.",
            "Grab a tennis ball to start playing tennis. Hit the ball over the net back and forth."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "When someone watches a sport, they can often picture themselves running across the court or the field.",
        "choices": [
            "The bowl can hold food reliably and tightly. It keeps food secure and makes it easy to transfer and move around.",
            "Hope filled her heart as she felt a wave of love for life. Claudia looked up and smiled, ready for all the possibilities.",
            "Whenever someone meets another person, they usually shake their hand as a way of saying hello.",
            "When she was asked to play a new sport she instantly froze. Gathering her courage, she put on her running shoes and ran onto the court."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "He adored him endlessly and felt his heart beating faster. Taking a leap of faith, he knelt down and proposed to the man he loved.",
        "choices": [
            "Food is often wasted due to overproduction or spoilage. This creates a huge strain on natural resources as well as the planet's food supply.",
            "An anemometer is used to measure wind speed. Attach it to the mast to take a precise reading.",
            "He loved her more than anything else. He finally mustered the courage to ask her and proposed to the woman he loved.",
            "Listen to your heart and musters the courage to ask the woman that you love to marry you. Take the leap of faith."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "Savory snacks tantalize the taste buds, while sweet treats satisfy the need for something sugary.",
        "choices": [
            "His appetite had gone stale from the same old food. He craved something new to wake up his taste buds.",
            "Aromatic candles scent the room. Unscented ones do not however, and are used for decorative purposes.",
            "Forgetting something usually refers to a process rather than a single event. Memories must be written over and pushed down to cease from cognitive function.",
            "Flimsy objects can't withstand pressure. Sturdy things hold up better."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "Convert a financial asset into cash. Money is gained.",
        "choices": [
            "The friction of the match head against the striker produces a spark. A small flame is created.",
            "The comfort friend gives a warm, comforting hug. The hug leaves a feeling of pleasantness and reassurance.",
            "Cash is a term for money. Coins, notes, and digital payments all represent financial assets.",
            "Watching the evening news is a way to learn about current events. You don't want to miss any important news stories."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "The materials go to a factory. Machines process the materials in the factory.",
        "choices": [
            "The food goes to the large instestine. Bacteria digest food in the large intestine.",
            "The machine takes in raw materials. The raw materials are further processed in the factory.",
            "A reader reads a book. The reader adds meaning to the words on the page.",
            "The bat hears echoes from the sounds bouncing off objects. The bat uses that information to navigate and to locate prey in the dark."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "A cat sharpens their claws to keep them sharp. The claws can be used to catch prey and defend itself.",
        "choices": [
            "The cat saw the mouse and instinctively began to chase. Its eyes were wide and its claws were extended as it raced after its prey.",
            "A house is built with its roof as its crown. The roof offers shelter and protection.",
            "Even a powerful car has its defects, like a missing headlight. A reminder of the challenges of life, even in large details.",
            "The fruit ripens, releasing its seeds. The seed is ready to be planted and grow into a new tree."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "A doctor listens with a stethoscope. The doctor can make an accurate diagnosis.",
        "choices": [
            "A television program begins. We can watch with excitement.",
            "A smart doctor makes the correct diagnosis quickly. Patients heal sooner.",
            "A bottle is filled with water. The bottle provides hydration when needed.",
            "The son is a part of the family. He is connected to each member of the family."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "He throws the weapon into the deep pool. It sinks and disappears from view.",
        "choices": [
            "The butterfly flutters by, its wings glowing with a luminous light. It's no wonder that it's admired by many.",
            "Acting hasty often results in mistakes. Patience is essential to arriving at the right solution.",
            "The weapon is buried deep in the ground. The weapon is kept out of sight.",
            "An investor pumps money into the capital markets. It is quickly absorbed into the system."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The monkey saw a bunch of bananas, excitedly jumping towards them. After devouring a few, the monkey was finally content.",
        "choices": [
            "The playground was full of children laughing and playing. The park was bustling with people and filled with the sound of joy.",
            "Jen wanted to make money off her new book. She launched a campaign to sell it in her neighborhood.",
            "The monkey eagerly takes the banana. He devours the treat with joy.",
            "The person opened up their wardrobe, eagerly searching for the perfect outfit. After trying on several, the perfect one finally emerged."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The sky was cloudless, birds soaring high in search of some food. The perfect setting for a mid-day stroll and to take in the breathtaking view.",
        "choices": [
            "With the crow's eyes, the bird can spot things from far away. Its vision allows it to spot potential food sources from the sky.",
            "The rubber on the tire reshapes itself around the road. The tire propels the car forward.",
            "A person visits several places. They move around, gathering experiences and creating memories.",
            "The water was still, fish barely making a ripple as they swam lazily. A perfect day for some relaxed fishing and soaking in the peaceful atmosphere."
        ],
        "answer": 3,
        "types": [
            "noun",
            "random",
            "random",
            "target"
        ]
    },
    {
        "source": "The car's body is made of metal and it bends with the force of an impact.",
        "choices": [
            "You can buy a ticket to the carnival at the ticket booth. Go to the carnival to get a fun night of excitement.",
            "She wanted to do housework so that she can have a clean house. She worked hard to make sure everything was spotless.",
            "Metal makes up most of a car's body. It helps protect the driver from external elements.",
            "The pencil's body is made of wood and it breaks easily under too much pressure."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Aluminum flows into streams and lakes. Acid rain dissolves minerals and nutrients in soil.",
        "choices": [
            "A jigsaw puzzle piece fits perfectly into the puzzle. The piece is secured in place with glue.",
            "Acid rain makes streams, lakes, and wetlands acidic. The water absorbs aluminum from soil.",
            "A stream or body of water rises. Water covers normally dry areas of the ground.",
            "Cars produce exhaust fumes. Acid rain corrodes metals and other surfaces."
        ],
        "answer": 3,
        "types": [
            "random",
            "noun",
            "random",
            "target"
        ]
    },
    {
        "source": "She heard a loud crack, signaling a fracture in her bones. The pain was blinding, and she knew she needed medical attention.",
        "choices": [
            "The sun was setting, creating a peaceful atmosphere. Sarah took in the sight, feeling blissfully bored.",
            "She was electrocuted, feeling the shock throughout her body. She fell to the ground, her muscles too weak to hold her up.",
            "Pain was radiating everywhere, and it was excruciating. Nothing seemed to be able to make the pain go away.",
            "She was attracted to the ludicrous, absurdly over-the-top trends. Putting on an outrageous oversized hat, she stepped out of her front door."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "The sudden spending spree causes an economic depletion. It leads to escalating levels of poverty.",
        "choices": [
            "Alice could skimp and allocate her money to the cheapest products. She found out it saved her a bit of money in the long run.",
            "She slowly closed her eyes and her mind became quiet. Resetting her brain and feeling energized, she had finally gone to sleep.",
            "The lack of money creates poverty. Wealth opens up endless opportunities.",
            "The outbreak is a precursor to devastation. It leads to widespread destruction."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "Carbon dioxide is expelled. Oxygen is taken to tissues.",
        "choices": [
            "The oxygen goes into the bloodstream. Oxygen is left and carbon dioxide is picked up.",
            "Hot air rises. Cool air is pulled down to the ground.",
            "The heat causes the molecules in the liquid to increase in energy. As the molecules absorb more energy, they start to move faster.",
            "The steam turns a generator. The generator produces the electricity."
        ],
        "answer": 1,
        "types": [
            "noun",
            "target",
            "random",
            "random"
        ]
    },
    {
        "source": "An abrasive material is rubbed against the skin. The friction causes the skin to become tender.",
        "choices": [
            "The epidermis is the outermost layer of the skin. It acts as a form of protection for the body.",
            "The theater director carefully monitored the actors on stage, giving corrections where needed. Every detail was considered.",
            "The corrosive liquid sits on the iron. Over time, the liquid will erode the iron and cause it to rust.",
            "The boat was packed with passengers who were eager to set sail. Everyone was thrilled for the journey ahead."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "The criminal joins in on the case. It's now a part of their story.",
        "choices": [
            "The fork lay atop the wooden table, a simple but essential tool for enjoying a meal. An indispensable part of any kitchen.",
            "He intoned the sentence clearly and had to be the judge of the crime. He was determined to find the right way forward.",
            "The person walks into the car lot and buys a car. It's now a part of their life.",
            "Her love for music was rooted deep within her. Dancing to its passionate rhythms, she moved with an audacious grace."
        ],
        "answer": 2,
        "types": [
            "random",
            "noun",
            "target",
            "random"
        ]
    },
    {
        "source": "A comfortable chair offers good support. People feel more relaxed and able to concentrate.",
        "choices": [
            "A smart doctor makes the correct diagnosis quickly. Patients heal sooner.",
            "He tossed his dog a bone, smushed with peanut butter. The dog instantly began chomping away on the treat.",
            "Doctors are part of a person's support network. With their help, people can achieve health and wellbeing.",
            "The strings on a guitar vibrate to make music. This entertains the audience."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "She used different seasonings to bring out the nutrition in her food. Variety was the key to a healthy diet.",
        "choices": [
            "The ending includes a letter written to the protagonist. Everyone cheers as the last words are read aloud.",
            "She was known for her vivacious attitude towards life. Taking care of her wellbeing was her key to maintaining her zest and energy.",
            "He utilized creative provocation during his classes in order to encourage learning. Engagement was the key to students' success.",
            "She carefully examined the nutrition and flavor of the food before purchasing it. She wanted the best and the healthiest option."
        ],
        "answer": 2,
        "types": [
            "random",
            "random",
            "target",
            "noun"
        ]
    },
    {
        "source": "The ventricle contracts. Blood leaves the heart through the pulmonic valve, into the pulmonary artery and to the lungs.",
        "choices": [
            "A cashier counts out change. Money leaves the register through the cash drawer, into the customer's hand and to their wallet.",
            "Puzzles can break apart and be put back together. The pieces can be reassembled into a complete puzzle.",
            "The breaking rock releases energy. The energy causes seismic waves.",
            "The blood travels into the right ventricle. The blood goes through the pulmonary arteries to the lungs."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "random",
            "noun"
        ]
    },
    {
        "source": "The man was tired of all the challengers publicly comparing themselves to him. He knew it was time to show them who he really was.",
        "choices": [
            "The woman was sick of her rival always one-upping her. She decided it was time to prove which of them was better.",
            "A brave man was full of resolve. He faced any and every challenge without hesitation.",
            "Moving forward in time, we observe progress with each milestone achieved. We see how far we have come, and what our next steps should be.",
            "She carefully pricked her finger and rubbed the tissue against the vein. Every drop of blood was vital to the experiment."
        ],
        "answer": 0,
        "types": [
            "target",
            "noun",
            "random",
            "random"
        ]
    },
    {
        "source": "The servant followed their master's orders faithfully. Their strict obedience ensured the smooth running of their household.",
        "choices": [
            "I realized the extent of my own knowledge. Attempting atonement, I sought forgiveness.",
            "The employee was an exemplary worker, dedicated to their tasks and loyal to their employer. Their commitment was never questioned.",
            "A father commands his servant to perform a task. The servant faithfully complies to the request.",
            "Goods are bought and sold quickly. The transfer of goods steadily increases."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    },
    {
        "source": "A person tries to accumulate as much knowledge as possible. The person eventually becomes overwhelmed with information and cannot take in any more.",
        "choices": [
            "The ground tries to absorb as much rain water as it can. The ground becomes saturated with rain water and cannot absorb anymore.",
            "Electrons flow through the circuit. Electrons flow back into the battery via the positive terminal.",
            "Ideas and knowledge are shared from person to person. The information is spread and shared throughout the population.",
            "The owl grabs the rodent with their tallons. The owl uses their beak to eat the rodent."
        ],
        "answer": 0,
        "types": [
            "target",
            "random",
            "noun",
            "random"
        ]
    },
    {
        "source": "Ideas seep into people's minds. The opinions expand.",
        "choices": [
            "People spread ideas and opinions. People influence and persuade others.",
            "Place the cake on a flat surface in the oven. Wait until cooked through.",
            "Water seeps into the cracks. The rock expands.",
            "The brain controls reflexes and voluntary actions. Vital hormones are regulated."
        ],
        "answer": 2,
        "types": [
            "noun",
            "random",
            "target",
            "random"
        ]
    },
    {
        "source": "Set the stove, furnace, or boiler up in the house. Buy bags of coal.",
        "choices": [
            "Hotter temperatures can create steam. Dew is formed similarly to steam.",
            "Ideas come into a person's head. A plan is created from the ideas.",
            "The coal is burned in a furnace. Water is turned into steam in the boiler.",
            "Set up the grill on the patio. Buy charcoal briquettes."
        ],
        "answer": 3,
        "types": [
            "random",
            "random",
            "noun",
            "target"
        ]
    },
    {
        "source": "The pressure of the steam pushing against a series of giant blades turns the turbine shaft. Turbine shaft is connected to the shaft of the generator.",
        "choices": [
            "Write the letter. Fold the letter.",
            "The force of water pushing against a series of blades turns a paddle wheel. The paddle wheel is connected to a pump which then pumps water.",
            "The steam spins propeller blades in the turbine. The spinning turbine rotates coils in the generator.",
            "The caterpillar develops into a butterfly. The butterfly lays a cocoon."
        ],
        "answer": 1,
        "types": [
            "random",
            "target",
            "noun",
            "random"
        ]
    }
]